{"version":"1","records":[{"hierarchy":{"lvl1":"About Me"},"type":"lvl1","url":"/about","position":0},{"hierarchy":{"lvl1":"About Me"},"content":"I work as an Atmospheric Data Scientist at Argonne National Laboratory, where I contribute to tools and infrastructure to enable open science.","type":"content","url":"/about","position":1},{"hierarchy":{"lvl1":"About Me","lvl2":"What I do"},"type":"lvl2","url":"/about#what-i-do","position":2},{"hierarchy":{"lvl1":"About Me","lvl2":"What I do"},"content":"Open Source and Open Science\n\nI work on projects that make analyzing large atmospheric/climate datasets easier, and ensure folks have an inclusive community around the tools to support robust communities of practice.\n\nI contribute to a few open-source projects that support the weather/climate community. In particular I am a core contributor to many projects in the \n\nPangeo ecosystem, and in particular the following major projects:\n\nPython ARM Radar Toolkit (Py-ART) - a Python library containing a collection of weather radar algorithms and utilities.\n\nxradar - includes all the tools to get your bring weather radar data in the \n\npangeo ecosystem.\n\nintake-esm - a data cataloging utility built on top of intake, pandas, and xarray, and it’s pretty awesome!\n\nThe Open Radar Forum - a place for the weather radar community to come together.\n\nFor an idea of the kinds of projects that I work on, check out my \n\nGitHub\n\nOutreach and Community Involvement\n\nI regularly teach short-courses at academic meetings, including the American Meteorological Society (AMS)Meetings (Radar and Annual), European Conference on Radar in Meteorology and Hydrology, as well as smaller workshops and webinars.\n\nI am also involved as co-chair of the AMS Committee on Environmental Information Processing Technologies, as well as co-chair for the Earth, Ocean, Geo, and Atmospheric Science track at the annual \n\nscientific python conference.\n\nFor a list of publications and scholarly artifacts (such as datasets) in which I’ve been involved,\ncheck out \n\nmy ORCID page or \n\nmy Google Scholar page.","type":"content","url":"/about#what-i-do","position":3},{"hierarchy":{"lvl1":"About Me","lvl2":"CV"},"type":"lvl2","url":"/about#cv","position":4},{"hierarchy":{"lvl1":"About Me","lvl2":"CV"},"content":"In a more CV/resume style, here is more information about my background:","type":"content","url":"/about#cv","position":5},{"hierarchy":{"lvl1":"About Me","lvl3":"Education","lvl2":"CV"},"type":"lvl3","url":"/about#education","position":6},{"hierarchy":{"lvl1":"About Me","lvl3":"Education","lvl2":"CV"},"content":"B.S. in Meteorology, Valparaiso University, 2019\n\nM.S. in Atmospheric Science, University of Illinois Urbana-Champaign, 2021\n\nIf you want a download-able CV, you can find a \n\n(mostly) up-to-date CV here.","type":"content","url":"/about#education","position":7},{"hierarchy":{"lvl1":"About Me","lvl2":"A Timeline"},"type":"lvl2","url":"/about#a-timeline","position":8},{"hierarchy":{"lvl1":"About Me","lvl2":"A Timeline"},"content":"Here is a brief timeline of my professional journey\n\n2022: Joined \n\nArgonne National Laboratory as an Atmospheric Data Scientist\n\nArgonne National Laboratory is a Department Energy Office of Science facility, where I work on projects\nrelated to open atmospheric and climate science. Key programs/projects I work on include:\n\nARM User Facility\n\nOpen Radar Community\n\nEarth System Grid Federation\n\nCROCUS UIFL\n\n2021: Joined NCAR\n\nAfter finishing graduate school at the University of Illinois, I began my data science career at the \n\nNational Center for Atmospheric Research, where I focused on developing open-source tools for the Climate and Global Dynamics laboratory, specifically those working with the Community Earth System Model (CESM). Here are a few of the main things I did during this time:\n\nKickstarted the \n\nEarth System Data Science initiative, writing 52 blog posts for the project.\n\nCo-lead development of \n\nintake-esm, a tool used for organizing petabyte-scale climate model datasets.\n\nHosted office hours for the community to ask \n\npangeo-related questions, building a community of practice around common analysis workflows.\n\nFall 2019: Started graduate school at the University of Illinois Urbana-Champaign\n\nMy scientific training began as an atmospheric scientist, where I studied deep convective storm dynamics in South America. I used observations from the \n\nRELAMPAGO-CACTI field campaign, which focused on some of the largest storms on earth, located in the Sierras de Cordoba region of Argentina. In particular I focused on relating observations from space-borne satellites to ground-based radars.\n\nSummer 2019: Interned at \n\nUnidata\n\nUnidata (a National Science Foundation funded organization) is a diverse community of education and research institutions with the common goal of sharing geoscience data and the tools to access and visualize that data. During my time there, I spent most of my time adding a \n\nMETAR parser to \n\nMetPy, the go-to python library for working with weather data.\n\n2019 Graduated from Valpo\n\nGraduated from Valparaiso University with a B.S. in Meteorology.\n\nThis page is largely based on \n\nChris Holdgraf’s personal website.","type":"content","url":"/about#a-timeline","position":9},{"hierarchy":{"lvl1":"Blog"},"type":"lvl1","url":"/blog","position":0},{"hierarchy":{"lvl1":"Blog"},"content":"You can see a full list by year to the left.\n\nArgonne Instruments at WFIP3: Days 3-4: A Full Weekend\n\n\n\n\nWe had a busy weekend deploying more instruments that are collecting data for the field observation portion of the 3rd Department of Energy funded Wind Forecast Improvement Project, which focuses on offshore wind regions off the coast of New England. On Saturday, we spent a bulk of the day putting\n\nDate: December 17, 2023 | Author: Max Grover | Tags: W, F, I, P, 3, ,,  , A, r, g, o, n, n, e, ,,  , I, n, s, t, r, u, m, e, n, t, s, ,,  , F, i, e, l, d,  , W, o, r, k\n\nArgonne Instruments at WFIP3: Day 2 - Installation Begins!\n\n\n\n\nToday was the first day of real installation work! We started with a quick breakfast at the hotel, then drove to the field site at sunrise (shown below).\n\n![Nantucket Morning](../images/morning-field-site.jpg)\n\n\nWe started by installing the meteorology tower, which includes sensors that measure wind speed, wind direction, temperature, precipitation, and moisture. The tower\n\nDate: December 15, 2023 | Author: Max Grover | Tags: W, F, I, P, 3, ,,  , A, r, g, o, n, n, e, ,,  , I, n, s, t, r, u, m, e, n, t, s, ,,  , F, i, e, l, d,  , W, o, r, k\n\nArgonne Instruments at WFIP3: Day 1 - Landing in Nantucket\n\n\n\n\n\nToday was the first day of my trip focused on deploying instruments from Argonne National Laboratory (ANL) (based in Lemont, Illinois), to the East Coast of the United States for the 3rd Wind Forecast Improvement Project (WFIP3). The project aims to improve wind forecasting ability within models, using both models\n\nDate: December 14, 2023 | Author: Max Grover | Tags: W, F, I, P, 3, ,,  , A, r, g, o, n, n, e, ,,  , I, n, s, t, r, u, m, e, n, t, s, ,,  , F, i, e, l, d,  , W, o, r, k\n\nAMS 2023 Reflections: Thank You Denver (and Boulder)!\n\n\n\n\nLast week, I attended the 103rd American Meteorological Society Annual Meeting in Denver Colorado. Prior to attending, I put together a blog post detailing my pre-conference thoughts and expressed a high level of excitement for this year’s conference. It did not disappoint. The week was full of meaningful connections with\n\nDate: January 16, 2023 | Author: Max Grover | Tags: A, M, S, ,,  , C, o, n, f, e, r, e, n, c, e, ,,  , C, o, l, o, r, a, d, o\n\nPre-AMS 2023 Reflection\n\n\n\n \nIt is hard to believe that tomorrow I will hop on a plane for AMS 2023. Am I prepared for all of my presentations, co-chair obligations, and general travel logistics? Absolutely not. I am however excited to reconnect with the weather community in beautiful Colorado, with this being the\n\nDate: January 05, 2023 | Author: Max Grover | Tags: A, M, S, ,,  , C, o, n, f, e, r, e, n, c, e, ,,  , C, o, l, o, r, a, d, o","type":"content","url":"/blog","position":1},{"hierarchy":{"lvl1":"Hi, I’m Max Grover 👋"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Hi, I’m Max Grover 👋"},"content":"\n\nA bit about me...\n\n💼 Atmospheric Data Scientist @ \n\nArgonne National Lab\n\n🌎 Active member of the \n\nPangeo Community\n\n🌕 Core developer of \n\nPy-ART and \n\nxradar\n\n🧪 M.S. in Atmospheric Science from \n\nthe Univ. of Illinois\n\nI also work on several other \n\nopen-source projects for science.\n\nAbout me ℹ️ :::{grid-item-card}\n:link: projects.md\nProjects I've worked on 🔧\n::: \n\nMy blog ✍️\n\nWorkshops 📚","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Media"},"type":"lvl1","url":"/media","position":0},{"hierarchy":{"lvl1":"Media"},"content":"As of recent, I have particpated in media outreach, talking to public media outlets about climate, weather, and data!\n\nIf you are interested in chatting, feel free to contact me via:\n\nMy work email: \n\nmgrover@anl.gov\n\nMy personal email: \n\nmgroverwx@gmail.com","type":"content","url":"/media","position":1},{"hierarchy":{"lvl1":"Media","lvl2":"2025"},"type":"lvl2","url":"/media#id-2025","position":2},{"hierarchy":{"lvl1":"Media","lvl2":"2025"},"content":"“Why 2024 Was Chicago’s Warmest Year In History”\n\nOnline Newspaper - Block Club Chicago\n\nJanuary 3, 2025","type":"content","url":"/media#id-2025","position":3},{"hierarchy":{"lvl1":"Media","lvl2":"2024"},"type":"lvl2","url":"/media#id-2024","position":4},{"hierarchy":{"lvl1":"Media","lvl2":"2024"},"content":"“Wrigley’s breeze, Guaranteed Rate’s heat: How climate change is impacting baseball in Chicago”\n\nTelevision - FOX32 Chicago\n\nMay 1, 2024\n\n“MLB Opening Day 2024: Climate change could have big impact on baseball, depending on where you are”\n\nTelevision - ABC7 Chicago\n\nMarch 28, 2024\n\n“Researchers Explore How Climate Change will Affect Wrigley and Guaranteed Rate Field”\n\nNewspaper - Daily Herald\n\nMarch 28, 2024\n\n“Chicago Had Warmest February On Record — And 5th Warmest Winter”\n\nOnline Newspaper - Block Club Chicago\n\nMarch 1, 2024\n\n“What’s behind Chicago’s fickle weather”\n\nRadio - WBEZ Chicago\n\nFebruary 27, 2024","type":"content","url":"/media#id-2024","position":5},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer"},"type":"lvl1","url":"/posts/2021/westward-bound","position":0},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer"},"content":"September is fast approaching which marks six months since I started my role as a software engineer at the National Center for Atmospheric Research. It is crazy to think that just six months ago, I was pushing to finish the first draft of my Master’s Thesis. So much has changed since then.","type":"content","url":"/posts/2021/westward-bound","position":1},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl2":"Finishing Graduate School During a Pandemic"},"type":"lvl2","url":"/posts/2021/westward-bound#finishing-graduate-school-during-a-pandemic","position":2},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl2":"Finishing Graduate School During a Pandemic"},"content":"I started at the University of Illinois in the Atmospheric Science graduate program in Fall of 2019, after completing the \n\nUnidata Summer Internship Program, moving from Boulder to Champaign. I remember leaving one of the parks in the Table Mesa neighborhood thinking that I wanted to come back to Boulder at some point...\n\nHere is a picture from the day I left Boulder in August 2019\n\nWe only had ~ 7 months of “normalcy” before classes switched to a virtual format, leading to a much different graduate school experience. As a rather extraverted person, I thrive when I am around other people, gathering energy from making connections with other people, especially within the weather and climate community (I am that person at AMS that comes back from ~12 hours of conferencing, more energized than when I left in the morning).\n\nI was able to spend more time with my family in Wisconsin during that experience, for which I am grateful for. I am privileged to have been able to spend am “extra” summer at the lake with my family, with our entire family remaining healthy. With their support, in addition to numerous virtual coffee breaks, happy hours, and random chats, I adapted to working from home, pushing ahead on my thesis research and finish the final few classes of my Masters coursework.","type":"content","url":"/posts/2021/westward-bound#finishing-graduate-school-during-a-pandemic","position":3},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl2":"Transitioning from Observational Mesoscale Meteorology to Software Engineering in the Ocean Section"},"type":"lvl2","url":"/posts/2021/westward-bound#transitioning-from-observational-mesoscale-meteorology-to-software-engineering-in-the-ocean-section","position":4},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl2":"Transitioning from Observational Mesoscale Meteorology to Software Engineering in the Ocean Section"},"content":"When I found out that I would be working with the biogeochemistry group in the ocean section within the Climate and Global Dynamics Lab at NCAR, I was honestly terrified. I have never taken an oceanography class before, nor have I ever worked with ocean model output. The last time I learned about biology was my first year of high school. To say I was out of my comfort zone would be an understatement. I was both excited to learn about a new field, while also terrified that I would be responsible for developing for data I have never worked with.\n\nFortunately, meeting my fellow group members and coworkers, as well as connecting with those within the Pangeo community helped address these fears and feel connected to our mission. I have learned so much from those within CGD, as well as across the entire UCAR organization over the past 6 months, despite starting remote during a global pandemic in the midst of finishing my thesis.","type":"content","url":"/posts/2021/westward-bound#transitioning-from-observational-mesoscale-meteorology-to-software-engineering-in-the-ocean-section","position":5},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl2":"Making the Move"},"type":"lvl2","url":"/posts/2021/westward-bound#making-the-move","position":6},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl2":"Making the Move"},"content":"I decided to make the move to Colorado in early July, once I found out I would be able to come into the office at least a few days a week. The thought of driving up to the Mesa Laboratory to my office a few days a week and meeting up with coworkers at area breweries was enough to convince me to finally make the move.\n\nThe chance to adventure into the mountains was also another farily compelling reason.\n\nSince being out here, I have been able to meet up with coworkers to go on hikes, visit breweries, and check out local coffee shops, all of which have been fanastic. In addition to connections with NCAR, I have met up with colleagues in Unidata, the National Weather Service, and weather/climate focused friends at various private companies in Colorado. I am still shocked how strong of a scientific community the Boulder area is - the shear density of earth scientists is amazing and something I am grateful to be a part of.","type":"content","url":"/posts/2021/westward-bound#making-the-move","position":7},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl2":"Reflecting on 6 Months In"},"type":"lvl2","url":"/posts/2021/westward-bound#reflecting-on-6-months-in","position":8},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl2":"Reflecting on 6 Months In"},"content":"I still can’t believe it has already been 6 months since I started my role at NCAR. There two primary initiatives/projects I have really been excited to be involved with:\n\nEarth System Data Science at NCAR\n\nProject Pythia","type":"content","url":"/posts/2021/westward-bound#reflecting-on-6-months-in","position":9},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl3":"ESDS at NCAR","lvl2":"Reflecting on 6 Months In"},"type":"lvl3","url":"/posts/2021/westward-bound#esds-at-ncar","position":10},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl3":"ESDS at NCAR","lvl2":"Reflecting on 6 Months In"},"content":"When I first started, I was told I would have an opportunity to be actively involved with the \n\nEarth System Data Science initiative at NCAR, working to change the culture around collaborating on scientific workflows. My main roles include:\n\nCoordinating biweekly work-in-progress talks\n\nBuilding and maintaining a repository/website to host materials related to ESDS\n\nPublish weekly blog posts detailing workflows related to CESM + general Pangeo stack\n\nFocus on using new prototypes being developed\n\nLearn + document “best practices”\n\nChat with people about this at office hours\n\nAdd documentation onto the \n\nESDS site under FAQ","type":"content","url":"/posts/2021/westward-bound#esds-at-ncar","position":11},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl3":"Project Pythia","lvl2":"Reflecting on 6 Months In"},"type":"lvl3","url":"/posts/2021/westward-bound#project-pythia","position":12},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl3":"Project Pythia","lvl2":"Reflecting on 6 Months In"},"content":"I have always been passionate about teaching others how to do more with their data using scientific Python stack, through the development of educational materials. I attended my first \n\nProject Pythia meeting, immediately excited about the collaboration between NCAR, Unidata, and UAlbany, all of which I had at least some connection to. As a software engineer intern in Summer 2019, I travelled to Albany, New York with Ryan May to help teach a Python workshop to the Atmospheric Science program there.\n\nThis spring and summer, we have continued to push forward to publishing the \n\nFoundations Book which covers the basics of Python for the geosciences, as well as the \n\nResource Gallery which provides access to a plethora of externally hosted content. I have also had the opportunity to be involved with the \n\nNCAR Python Tutorial Series, as both a chat moderator (helper) and presenter.","type":"content","url":"/posts/2021/westward-bound#project-pythia","position":13},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl2":"Conclusions"},"type":"lvl2","url":"/posts/2021/westward-bound#conclusions","position":14},{"hierarchy":{"lvl1":"Westward Bound: Midwestern Grad Student to a Colorado Software Engineer","lvl2":"Conclusions"},"content":"Thinking about how much has changed over the past 6 months can be tough to comprehend - I am working with completely different data, different teams, halfway across the country. One thing that hasn’t changed is my passion for working on open source software and helping + teaching others about the Python ecosystem. When I wake up everyday and log on, I am genuinely excited. I love what I do - having the opportunity to develop new tools, prototype solutions, and teach people how to use those tools and packages does not feel like work.\n\nI am grateful for all the professional development and leadership opportunties that have been offered to me thus far in my career in NCAR/UCAR, including:\n\nPresenting on the current state of CESM diagnostics at the CESM workshop\n\nAttending the Dask Summit and SciPy Conferences\n\nParticipating in “Scalable Python using Dask” class\n\nI look forward to continuing to present at conferences and workshops, sharing what we are learning through our collaborations both at NCAR/UCAR and the wider Pangeo community.\n\nIf you are interested in the weekly ESDS blog posts I mentioned before, \n\nhere is a link!\n\nStay tuned for additional personal update posts!","type":"content","url":"/posts/2021/westward-bound#conclusions","position":15},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways"},"type":"lvl1","url":"/posts/2022/earthcube-takeaways","position":0},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways"},"content":"Last week, I attended the Earthcube Annual Meeting in San Diego, California!","type":"content","url":"/posts/2022/earthcube-takeaways","position":1},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways","lvl2":"What’s Earthcube? Why did I go?"},"type":"lvl2","url":"/posts/2022/earthcube-takeaways#whats-earthcube-why-did-i-go","position":2},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways","lvl2":"What’s Earthcube? Why did I go?"},"content":"Earthcube is an organization, funded by the National Science Foundation, which is focused around facilitating communities and practices related to geoscience data and cyberinfrastructure (the computers + software needed to get science done). From their \n\nofficial information page: “For nearly a decade, the EarthCube community has been transforming the conduct of geosciences research by developing and maintaining a well-connected and facile environment that improves access, sharing, visualization, and analysis of data and related resources. While sharable tools, methods, and cyberinfrastructure have been critical achievements for EarthCube, we find that our dedicated community is what makes our program successful.” \n\nThey have an annual meeting, which was held virtually the past two years due to the global pandemic, with this being the first in-person meeting since 2019. I have been an active contributor to one of their related projects, \n\nProject Pythia, which is an commmunity resource for learning how to get started with Python for the geosciences.\n\nHere is an image from the conference venue, the Scripps Institution of Oceanography.","type":"content","url":"/posts/2022/earthcube-takeaways#whats-earthcube-why-did-i-go","position":3},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways","lvl2":"What did I present?"},"type":"lvl2","url":"/posts/2022/earthcube-takeaways#what-did-i-present","position":4},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways","lvl2":"What did I present?"},"content":"I presented on progress related to a collaboration with Project Pythia at the Atmospheric Radiation Measurement (ARM) user facility, our Radar Cookbook! The cookbook expands upon the Pythia Foundations material, covering more advanced topics related to working with open weather radar data using open source Python tools, specifically Py-ART!","type":"content","url":"/posts/2022/earthcube-takeaways#what-did-i-present","position":5},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways","lvl3":"The Radar Cookbook Poster","lvl2":"What did I present?"},"type":"lvl3","url":"/posts/2022/earthcube-takeaways#the-radar-cookbook-poster","position":6},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways","lvl3":"The Radar Cookbook Poster","lvl2":"What did I present?"},"content":"Here is the poster I presented:\n\nIf you are interested in checking out our radar cookbook, here is the link:\n\nRadar Cookbook\n\nThe poster presentation went great and I received quite a bit of positive feedback in addition to some possible collaborations with other members of the geoscience community.","type":"content","url":"/posts/2022/earthcube-takeaways#the-radar-cookbook-poster","position":7},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways","lvl2":"How was San Diego?"},"type":"lvl2","url":"/posts/2022/earthcube-takeaways#how-was-san-diego","position":8},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways","lvl2":"How was San Diego?"},"content":"The conference was on the Northside of San Diego, specifically in La Jolla at the Scripps Seaside Forum. I can honestly say that this was the most beautiful conference venue I have ever seen. Here is a picture of the tables set outside for breakfast every morning.\n\nWe were blessed with fantastic weather the whole week (except for a bit of mist on the way from the airport to the hotel on the first day). This allowed us to eat outside for all of our meals, keep doors and windows open to enhance airflow, and generally convene in a healthy COVID-preventative environment. I am thankful the conference organizers and attendees took COVID precautions seriously.\n\nI had a chance to check out some local restaurants, including the Shore Rider in La Jolla Shores and Dukes in downtown La Jolla. Both places had incredible seafood, which I don’t eat too often in the Midwest!","type":"content","url":"/posts/2022/earthcube-takeaways#how-was-san-diego","position":9},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways","lvl2":"What were my main takeaways from the meeting itself?"},"type":"lvl2","url":"/posts/2022/earthcube-takeaways#what-were-my-main-takeaways-from-the-meeting-itself","position":10},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways","lvl2":"What were my main takeaways from the meeting itself?"},"content":"While I could likely assemble several pages of takeaways from the conference, here are four(ish) main points and resources\n\nEathcube has been around for a while, and has enabled an incredible community of both domain scientists  and cyberinfrastructure folks\n\nTracking metadata and connecting data is tough - there are so many ongoing projects and efforts to make this easier, with one of the main being the \n\nGeocodes Project\n\nAnother neat project is the \n\nData Commons project, another large collaboration mainly focused on Census, climate, and other geographic data sources\n\nWith Earthcube winding down (this is the last year of NSF funding), best practices and lessons learned are being assembled, with most notes going into the sustainability document\n\nEarthcube Sustainability Document\n\nOne of the main innovations to come out of Earthcube is the idea of (Jupyter) Notebooks as Scholarly Publishing, including a well-developed review process and collaboration with AGU and other societies. Here is a link to this year’s accepted submissions hosted on Github:\n\nEarthcube Posters\n\nI very much enjoyed the format of the meeting, with a good mix of conference-style talks, workshops, and networking opportunities. I hope other conferences will take a look at their schedule (\n\nEarthcube Annual Meeting 2022 Schedule) and consider structuring theirs in a similar way!","type":"content","url":"/posts/2022/earthcube-takeaways#what-were-my-main-takeaways-from-the-meeting-itself","position":11},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways","lvl2":"Conclusions"},"type":"lvl2","url":"/posts/2022/earthcube-takeaways#conclusions","position":12},{"hierarchy":{"lvl1":"Earthcube Annual Meeting Takeaways","lvl2":"Conclusions"},"content":"Last week’s conference was amazing. Even though I am not funded by an Earthcube related project, it was a fantastic place to present our progress on radar cookbooks, and how ARM + DOE fits into this space. We are fortunate to have our \n\nARM data portal, which adheres to the FAIR (Findable, Accessible, Interoperable, and Reproducible) guidelines, and support for software development related to working with these datasets. I hope to connect more with the Earthcube community, making our resources findable on their tools (such as geocodes).I look forward to making more progress on our Open Science cookbooks, enabling more science in our community!","type":"content","url":"/posts/2022/earthcube-takeaways#conclusions","position":13},{"hierarchy":{"lvl1":"ERAD Takeaways"},"type":"lvl1","url":"/posts/2022/erad-2022-takeaways","position":0},{"hierarchy":{"lvl1":"ERAD Takeaways"},"content":"This week, I attended the 11th  European Conference on Radar in Meteorology and Hydrology in Locarno, Switzerland! This conference brought a large community of weather forecast agencies (hosted by Meteoswiss, the Swiss weather service), researchers, software developers, vendors, and other members of the private sector.\n\nThe conference consisted of two main parts:\n\n“The Academy” which were day long short courses\n\nOpen Radar Software\n\nPySteps - a tool focused around nowcasting (short term weather forecasting on the order of hours)\n\nUsing polarimetric weather radar data\n\nThe conference\n\n~12 minute conference-style talks\n\nTriplets where three people presented together on a similar topic\n\nLectures presented by well-respected members of the field","type":"content","url":"/posts/2022/erad-2022-takeaways","position":1},{"hierarchy":{"lvl1":"ERAD Takeaways","lvl2":"The Workshop"},"type":"lvl2","url":"/posts/2022/erad-2022-takeaways#the-workshop","position":2},{"hierarchy":{"lvl1":"ERAD Takeaways","lvl2":"The Workshop"},"content":"","type":"content","url":"/posts/2022/erad-2022-takeaways#the-workshop","position":3},{"hierarchy":{"lvl1":"ERAD Takeaways","lvl3":"The Pre-Workshop Meeting","lvl2":"The Workshop"},"type":"lvl3","url":"/posts/2022/erad-2022-takeaways#the-pre-workshop-meeting","position":4},{"hierarchy":{"lvl1":"ERAD Takeaways","lvl3":"The Pre-Workshop Meeting","lvl2":"The Workshop"},"content":"I helped teach/setup the infrastructure for the Open Radar Software workshop. We arrived two days before the short course started since we setup our first joint-Open Radar Software developers meeting on Saturday. Meteoswiss kindly hosted this meeting, where we discussed the logistics for the workshop and highlighted next steps forward for our community.\n\nOne of the key opportunities for collaboration discussed during this meeting (and will be a priority moving forward) is a new package focused solely on a new data model for radar data in Python. We will build the necessary tools to load radar data into the Pangeo-friendly standard data model - Xarray! Moving to this data model, will enable cross compatibility across the Pangeo stack, and conform to the proposed cfradial2 standard, which will soon be adopted by the World Meteorological Organization.\n\nA graphic from the cfradial2 standard is summarized below (thanks to Mark Curtis), highlighting the hierarchal data model approach, which aligns with the recently developed xarray-datatree package. The conference material will be available after the conference, so I encourage you check out the rest of Mark Curtis’s poster!\n\n\nCfradial2 data structure, as summarized by Mark Curtis in his poster.","type":"content","url":"/posts/2022/erad-2022-takeaways#the-pre-workshop-meeting","position":5},{"hierarchy":{"lvl1":"ERAD Takeaways","lvl3":"The Workshop","lvl2":"The Workshop"},"type":"lvl3","url":"/posts/2022/erad-2022-takeaways#the-workshop-1","position":6},{"hierarchy":{"lvl1":"ERAD Takeaways","lvl3":"The Workshop","lvl2":"The Workshop"},"content":"The workshop has been taught for a number of years, originally starting with a Virtual Machine approach that required users downloading the virtual machine software, importing the image, and running on their local laptop. We have since adapted the content to run on the Pangeo hub (using the Project Pythia cookbook theme), using the Jupyter stack (JupyterBook, JupyterHub, and Jupyter notebooks). Using this new stack led to a quicker time-to-science, which was amazing!\n\nIf you are interested in going through the content, here is a link to the book!\n\nopenradarscience​.org​/erad2022\n\nWe are appreciative of communities such as Pangeo, and organizations like 2i2c for making the setup and deployment of this workshop so straightforward and accessible.","type":"content","url":"/posts/2022/erad-2022-takeaways#the-workshop-1","position":7},{"hierarchy":{"lvl1":"ERAD Takeaways","lvl2":"The Conference"},"type":"lvl2","url":"/posts/2022/erad-2022-takeaways#the-conference","position":8},{"hierarchy":{"lvl1":"ERAD Takeaways","lvl2":"The Conference"},"content":"It was incredible seeing the variety of research presented at ERAD. Talks ranged from precipitation estimation methods to observations of bugs and birds across Europe. One major commonality across a collection of the talks was the reliance on open radar software. While not all the talks used Py-ART,   quite a few did, in addition to other packages such as wradlib, LROSE, or BALTRAD. It was inspiring to see so many members of the operational and research weather community using our software for their science.\n\nOne of the first talks, presented partly by Daniel Michelson, highlighted that the future of European weather radar data is open. They are working to open the shared radar data, currently only available to a small community, to the entire science community over the next few years. The key product they mentioned is a blended Europe-wide radar product.\n\nI also jotted down quite a few new ideas for improved visualization methods in Py-ART, where we can improve our documentation, and new blog posts highlighting how Py-ART is being used around the world. The first blog post we want to work with the Metoswiss folks to put together is one walking through how Meteoswiss uses Py-ART for qualitative precipitation estimation (QPE). This was one of the examples during the workshop, but it would be great to have a deeper dive into this workflow!","type":"content","url":"/posts/2022/erad-2022-takeaways#the-conference","position":9},{"hierarchy":{"lvl1":"ERAD Takeaways","lvl2":"The City"},"type":"lvl2","url":"/posts/2022/erad-2022-takeaways#the-city","position":10},{"hierarchy":{"lvl1":"ERAD Takeaways","lvl2":"The City"},"content":"The city of Locarno was gorgeous. Wednesday afternoon’s schedule included an excursion of the conference goers choice. I chose the Gormet Grotto option, which was a trip to a delicious local restaurant nestled in one of the local valleys. I included an image of the of the restaurant below:\n\nAfter the conference, I took the chairlift up to the top of the nearest mountain to get a better look of the City of Locarno. I attached that picture\nhere too!\n\nI appreciate all the hard work the ERAD 2022 conference planning committee put in to making this event possible, and I am grateful they\nchose such a beautiful city for the conference.","type":"content","url":"/posts/2022/erad-2022-takeaways#the-city","position":11},{"hierarchy":{"lvl1":"ERAD Takeaways","lvl2":"The Future of Open Radar"},"type":"lvl2","url":"/posts/2022/erad-2022-takeaways#the-future-of-open-radar","position":12},{"hierarchy":{"lvl1":"ERAD Takeaways","lvl2":"The Future of Open Radar"},"content":"I am excited to have been brought onto the Open Radar Science team. I am thankful that Scott Collis and the team at Argonne/ARM provided me the opportunity to not only join the team, but travel to Switzerland to enable our radar community to do more science. I made many new connections, especially with the other software developers, and look forward to continuing to grow these collaborations and friendships. I look forward to continuing to grow the open radar science community, as well the more general Pangeo community.\n\nWe have already setup our refreshed website (using the pydata-sphinx theme), which was a byproduct of working with Kai (the main wradlib developer) during the conference.\n\nHere is a link to the new site!\n\nopenradarscience​.org\n\nTime to start the count down to AMS Radar 2023 in Minneapolis, and ERAD 2024 in Rome, Italy.","type":"content","url":"/posts/2022/erad-2022-takeaways#the-future-of-open-radar","position":13},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!"},"type":"lvl1","url":"/posts/2022/fall-colors-ghcnd","position":0},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!"},"content":"Tonight, Ben Blaiszik \n\n() mentioned the following:\n\nSo, I sat down to see if I could answer this question, using the \n\nGlobal Historical Climatology Network daily (GHCNd) dataset.\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd","position":1},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"The Data"},"type":"lvl2","url":"/posts/2022/fall-colors-ghcnd#the-data","position":2},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"The Data"},"content":"This dataset is commonly used for calculating climatological normals, with long records and worldwide spatial coverage. It is provided by NOAA, with a version stored on the cloud (Amazon Web Services).\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#the-data","position":3},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Imports"},"type":"lvl2","url":"/posts/2022/fall-colors-ghcnd#imports","position":4},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Imports"},"content":"We use calendar for months, core components of the scientific python stack, hvplot for visualization, Dask for parallel and distributed computing, and Cartopy for mapping.\n\nimport calendar\n\nimport numpy as np\nimport pandas as pd\nimport holoviews as hv\nimport hvplot.pandas\nfrom distributed import LocalCluster\nimport cartopy.crs as ccrs\nhv.extension('bokeh')\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#imports","position":5},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Spin up a Cluster"},"type":"lvl2","url":"/posts/2022/fall-colors-ghcnd#spin-up-a-cluster","position":6},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Spin up a Cluster"},"content":"This spins up a local Dask cluster to use for the analysis.\n\ncluster = LocalCluster()\ncluster\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#spin-up-a-cluster","position":7},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Read in the GHCN Data"},"type":"lvl2","url":"/posts/2022/fall-colors-ghcnd#read-in-the-ghcn-data","position":8},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Read in the GHCN Data"},"content":"Let’s get to accessing the data.. the main documentation can be found here:\n\nhttps://​www​.ncei​.noaa​.gov​/products​/land​-based​-station​/global​-historical​-climatology​-network​-daily\n\nWe are interested in:\n\nthe daily maximum temperature (TMAX)\n\nthe daily minimum temperature (TMIN)\n\nthe daily precipitation accumulation (PRCP)","type":"content","url":"/posts/2022/fall-colors-ghcnd#read-in-the-ghcn-data","position":9},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"The Stations Table","lvl2":"Read in the GHCN Data"},"type":"lvl3","url":"/posts/2022/fall-colors-ghcnd#the-stations-table","position":10},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"The Stations Table","lvl2":"Read in the GHCN Data"},"content":"The first step to retrieving this dataset is determing which location to use. There is a table for this, but it requires some custom code specifications to load into our dataframe.\n\nThis code was provided by Ned Haughton, through his gitlab.\n\n\"\"\"\nFile: read_ghcn.py\nAuthor: Ned Haughton\nDescription: Code for reading GHCN dly file data\nhttps://gitlab.com/-/snippets/1838910\n\"\"\"\n\nimport pandas as pd\n\n\n# Metadata specs #\n\nmetadata_col_specs = [\n    (0,  12),\n    (12, 21),\n    (21, 31),\n    (31, 38),\n    (38, 41),\n    (41, 72),\n    (72, 76),\n    (76, 80),\n    (80, 86)\n]\n\nmetadata_names = [\n    \"ID\",\n    \"LATITUDE\",\n    \"LONGITUDE\",\n    \"ELEVATION\",\n    \"STATE\",\n    \"NAME\",\n    \"GSN FLAG\",\n    \"HCN/CRN FLAG\",\n    \"WMO ID\"]\n\nmetadata_dtype = {\n    \"ID\": str,\n    \"STATE\": str,\n    \"NAME\": str,\n    \"GSN FLAG\": str,\n    \"HCN/CRN FLAG\": str,\n    \"WMO ID\": str\n    }\n\n\n# Data specs #\n\ndata_header_names = [\n    \"ID\",\n    \"YEAR\",\n    \"MONTH\",\n    \"ELEMENT\"]\n\ndata_header_col_specs = [\n    (0,  11),\n    (11, 15),\n    (15, 17),\n    (17, 21)]\n\ndata_header_dtypes = {\n    \"ID\": str,\n    \"YEAR\": int,\n    \"MONTH\": int,\n    \"ELEMENT\": str}\n\ndata_col_names = [[\n    \"VALUE\" + str(i + 1),\n    \"MFLAG\" + str(i + 1),\n    \"QFLAG\" + str(i + 1),\n    \"SFLAG\" + str(i + 1)]\n    for i in range(31)]\n# Join sub-lists\ndata_col_names = sum(data_col_names, [])\n\ndata_replacement_col_names = [[\n    (\"VALUE\", i + 1),\n    (\"MFLAG\", i + 1),\n    (\"QFLAG\", i + 1),\n    (\"SFLAG\", i + 1)]\n    for i in range(31)]\n# Join sub-lists\ndata_replacement_col_names = sum(data_replacement_col_names, [])\ndata_replacement_col_names = pd.MultiIndex.from_tuples(\n    data_replacement_col_names,\n    names=['VAR_TYPE', 'DAY'])\n\ndata_col_specs = [[\n    (21 + i * 8, 26 + i * 8),\n    (26 + i * 8, 27 + i * 8),\n    (27 + i * 8, 28 + i * 8),\n    (28 + i * 8, 29 + i * 8)]\n    for i in range(31)]\ndata_col_specs = sum(data_col_specs, [])\n\ndata_col_dtypes = [{\n    \"VALUE\" + str(i + 1): int,\n    \"MFLAG\" + str(i + 1): str,\n    \"QFLAG\" + str(i + 1): str,\n    \"SFLAG\" + str(i + 1): str}\n    for i in range(31)]\ndata_header_dtypes.update({k: v for d in data_col_dtypes for k, v in d.items()})\n\n\n# Reading functions #\n\ndef read_station_metadata(filename):\n    \"\"\"Reads in station metadata\n\n    :filename: ghcnd station metadata file.\n    :returns: station metadata as a pandas Dataframe\n\n    \"\"\"\n    df = pd.read_fwf(filename, colspecs=metadata_col_specs, names=metadata_names,\n                     index_col='ID', dtype=metadata_dtype)\n\n    return df\n\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#the-stations-table","position":11},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl4":"Load the station data using the function","lvl3":"The Stations Table","lvl2":"Read in the GHCN Data"},"type":"lvl4","url":"/posts/2022/fall-colors-ghcnd#load-the-station-data-using-the-function","position":12},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl4":"Load the station data using the function","lvl3":"The Stations Table","lvl2":"Read in the GHCN Data"},"content":"We can remotely read in the dataset using the following - no download required!\n\nstation_data = read_station_metadata(\"https://www.ncei.noaa.gov/pub/data/ghcn/daily/ghcnd-stations.txt\")\nstation_data\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#load-the-station-data-using-the-function","position":13},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Visualize the GHCNd Dataset"},"type":"lvl2","url":"/posts/2022/fall-colors-ghcnd#visualize-the-ghcnd-dataset","position":14},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Visualize the GHCNd Dataset"},"content":"Let’s visualize the spatial extent. We can use a spatial density map, setting rasterize=True, and adding our different features for reference.\n\nstation_data.hvplot.points(x='LONGITUDE',\n                           y='LATITUDE',\n                           rasterize=True,\n                           geo=True,\n                           features=['ocean', 'land', 'borders', 'lakes'],\n                           projection=ccrs.PlateCarree(),\n                           title='GHCNd Station Locations')\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#visualize-the-ghcnd-dataset","position":15},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"Zoom in Around Chicago","lvl2":"Visualize the GHCNd Dataset"},"type":"lvl3","url":"/posts/2022/fall-colors-ghcnd#zoom-in-around-chicago","position":16},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"Zoom in Around Chicago","lvl2":"Visualize the GHCNd Dataset"},"content":"Let’s zoom in around Chicago! This allows us to investigate specific stations around this area.\n\nlat_min = 41\nlat_max = 43\nlon_min = -89\nlon_max = -87\n\nstations_around_chicago = station_data[(station_data.LATITUDE > lat_min) & \n                                       (station_data.LATITUDE < lat_max) & \n                                       (station_data.LONGITUDE < lon_max) &\n                                       (station_data.LONGITUDE > lon_min)]\nstations_around_chicago\n\nstations_around_chicago.hvplot.points(x='LONGITUDE',\n                                      y='LATITUDE',\n                                      geo=True,\n                                      features=['ocean', 'land', 'borders', 'lakes'],\n                                      projection=ccrs.PlateCarree(),\n                                      hover_cols=['ID', 'NAME'],\n                                      title='GHCNd Stations Around Chicago')\n\nWe will use the O’Hare International Airport site here, USW00094846, which is second to last value in the table.\n\n\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#zoom-in-around-chicago","position":17},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Access Station Data from AWS"},"type":"lvl2","url":"/posts/2022/fall-colors-ghcnd#access-station-data-from-aws","position":18},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Access Station Data from AWS"},"content":"Now that we have our station decided, we can load our data from AWS.\n\nHere is the landing page for their documentation\n\nhttps://​registry​.opendata​.aws​/noaa​-ghcn/","type":"content","url":"/posts/2022/fall-colors-ghcnd#access-station-data-from-aws","position":19},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"Finding our Data","lvl2":"Access Station Data from AWS"},"type":"lvl3","url":"/posts/2022/fall-colors-ghcnd#finding-our-data","position":20},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"Finding our Data","lvl2":"Access Station Data from AWS"},"content":"The directories in the bucket are configured as follows:s3://noaa-ghcn-pds/parquet/by_station/STATION={INSERT_STATION_ID}/\n\nfor example,s3://noaa-ghcn-pds/parquet/by_station/STATION=USW00094846/\n\nis the path to the file for Chicago O’Hare.\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#finding-our-data","position":21},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"Read our Data using Pandas","lvl2":"Access Station Data from AWS"},"type":"lvl3","url":"/posts/2022/fall-colors-ghcnd#read-our-data-using-pandas","position":22},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"Read our Data using Pandas","lvl2":"Access Station Data from AWS"},"content":"Now that we found our data, we can access it using the following, setting our station ID to USW00094846.\n\nstation = 'USW00094846'\nohare = pd.read_parquet(f's3://noaa-ghcn-pds/parquet/by_station/STATION={station}/',\n                        storage_options={'anon':True})\nohare\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#read-our-data-using-pandas","position":23},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"Clean up the Data","lvl2":"Access Station Data from AWS"},"type":"lvl3","url":"/posts/2022/fall-colors-ghcnd#clean-up-the-data","position":24},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"Clean up the Data","lvl2":"Access Station Data from AWS"},"content":"Now, we can clean the data. We\n\nConvert the date column to a datetime column\n\nSubset for our variables, and assign to their own dataframe\n\nRename the columns\n\nConvert from tenths of degrees Celsius to degrees Celsius (divide by 10)\n\n# Clean up the dates\nohare['DATE'] = pd.to_datetime(ohare.DATE)\n\n# Subset for tmax, tmin, and precipitation\ntmax = ohare.loc[ohare.ELEMENT == 'TMAX']\ntmin = ohare.loc[ohare.ELEMENT == 'TMIN']\nprecipitation = ohare.loc[ohare.ELEMENT == 'PRCP']\n\n# Rename the columns, set the index to the date\ntmax_df = tmax[['DATE', 'DATA_VALUE']].rename(columns={'DATA_VALUE': 'TMAX'}).set_index('DATE')\ntmin_df = tmin[['DATE', 'DATA_VALUE']].rename(columns={'DATA_VALUE': 'TMIN'}).set_index('DATE')\nprecip_df = precipitation[['DATE', 'DATA_VALUE']].rename(columns={'DATA_VALUE': 'PRCP'}).set_index('DATE')\n\n# Convert to degrees Celsius\ntmax_df['TMAX'] = tmax_df.TMAX/10\ntmin_df['TMIN'] = tmin_df.TMIN/10\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#clean-up-the-data","position":25},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Calculate and Visualize the Temperature and Precipitation Fields"},"type":"lvl2","url":"/posts/2022/fall-colors-ghcnd#calculate-and-visualize-the-temperature-and-precipitation-fields","position":26},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Calculate and Visualize the Temperature and Precipitation Fields"},"content":"Now that we have a clean dataset, we setup the following function to calculate the normal, using the 1990-2020 time frame as the default reference, and compares a given year to this normal.\n\nThis gives us a frame of reference for how “normal” the climatological field is.\n\ndef plot_monthly_stats(df, year=2022, ylabel=None, first_year=1990, last_year=2020):\n    \"\"\"\n    Helper function to calculate the averages and plot our data\n    \"\"\"\n    \n    if first_year is None:\n        first_year = df.index.year.min()\n        \n    if last_year is None:\n        last_year = df.index.year.max()\n    \n    # Grab the month names from the calendar module\n    months = list(calendar.month_name)[1:]\n    \n    # Subset for the averaging period\n    df_normal = df[(df.index.year >= first_year) & (df.index.year <= last_year)]\n    \n    # Calculate the average monthly values over the entire dataset\n    monthly_value = df_normal.groupby(df_normal.index.month).mean()\n    monthly_value.index = months\n    \n    # Calculate the given year average\n    df_year = df[df.index.year == year]\n    monthly_average = df_year.groupby(df_year.index.month).mean()\n    monthly_average.index = months[:monthly_average.index[-1]]\n    \n    if 'TMAX' in df.columns:\n        color = 'red'\n        ylabel = 'Daily Maximum Temperature \\n (degC)'\n\n    elif 'TMIN' in df.columns:\n        color = 'blue'\n        ylabel = 'Daily Minimum Temperature \\n (degC)'\n    \n    elif 'PRCP' in df.columns:\n        color = 'green'\n        ylabel = 'Daily Accumulated Precipitation \\n (mm)'\n        \n    else:\n        color='grey'\n    \n    return monthly_value.hvplot.line(xlabel='Monthly',\n                                     ylabel=ylabel,\n                                     label=f'Monthly Average {first_year} - {last_year}',\n                                     color='k') * monthly_average.hvplot.line(label=f'Monthly Average {year}',\n                                                                              color=color,\n                                                                              line_width=3)\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#calculate-and-visualize-the-temperature-and-precipitation-fields","position":27},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"Plot the 2022 Comparison","lvl2":"Calculate and Visualize the Temperature and Precipitation Fields"},"type":"lvl3","url":"/posts/2022/fall-colors-ghcnd#plot-the-2022-comparison","position":28},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"Plot the 2022 Comparison","lvl2":"Calculate and Visualize the Temperature and Precipitation Fields"},"content":"Let’s start with 2022 - notice how relatively dry the last few months have been, with normal high daily maximum temperatures and above normal daily minimum temperatures.\n\nWarm and dry are two ingredients for nice fall colors in the Midwest!\n\n(plot_monthly_stats(precip_df) + plot_monthly_stats(tmax_df) + plot_monthly_stats(tmin_df)).cols(1)\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#plot-the-2022-comparison","position":29},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"Plot 2015-2022 for Comparison","lvl2":"Calculate and Visualize the Temperature and Precipitation Fields"},"type":"lvl3","url":"/posts/2022/fall-colors-ghcnd#plot-2015-2022-for-comparison","position":30},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl3":"Plot 2015-2022 for Comparison","lvl2":"Calculate and Visualize the Temperature and Precipitation Fields"},"content":"For comparison, here are the last seven years!\n\nfor year in np.arange(2015, 2023, 1):\n    display((plot_monthly_stats(precip_df, year) + plot_monthly_stats(tmax_df, year) + plot_monthly_stats(tmin_df, year)).cols(1))\n\n","type":"content","url":"/posts/2022/fall-colors-ghcnd#plot-2015-2022-for-comparison","position":31},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Conclusions"},"type":"lvl2","url":"/posts/2022/fall-colors-ghcnd#conclusions","position":32},{"hierarchy":{"lvl1":"Chicago Fall Colors in Context: Using GHCNd Data!","lvl2":"Conclusions"},"content":"It has been an absolutely beautiful fall in the Chicago area (and the Upper Midwest in general). Here is one of my pictures from mid October, from Matthiessen State Park in Oglesby, Illinois.\n\nThe availability of these cloud-hosted datasets is incredible - the analysis-ready nature of these datasets lower the barrier to science. Instead of parsing through thousands of text files, or merging tough-to-align CSVs, people can access these analysis-ready, cloud optimized datasets (stored in Parquet in this case), and jump right into their analysis.\n\nThank you NOAA and AWS for making these datasets available, Ned Haughton for the station table parsing code, and Ben for the motivation.","type":"content","url":"/posts/2022/fall-colors-ghcnd#conclusions","position":33},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot"},"type":"lvl1","url":"/posts/2022/hurricane-ian-hvplot","position":0},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot"},"content":"Within this post, we explore how we can use \n\nhvPlot to plot data from Hurricane Ian, which will soon make landfall in Florida.","type":"content","url":"/posts/2022/hurricane-ian-hvplot","position":1},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl2":"Motivation"},"type":"lvl2","url":"/posts/2022/hurricane-ian-hvplot#motivation","position":2},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl2":"Motivation"},"content":"By the end of this post, you will be able to recreate the following plot:\n\n\n","type":"content","url":"/posts/2022/hurricane-ian-hvplot#motivation","position":3},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl2":"Imports"},"type":"lvl2","url":"/posts/2022/hurricane-ian-hvplot#imports","position":4},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl2":"Imports"},"content":"\n\nimport cartopy.crs as ccrs\nimport geopandas as gpd\nimport fiona\n\nfrom siphon.simplewebservice.ndbc import NDBC\nimport holoviews as hv\nimport hvplot.pandas\nfiona.drvsupport.supported_drivers['libkml'] = 'rw' # enable KML support which is disabled by default\nfiona.drvsupport.supported_drivers['LIBKML'] = 'rw' # enable KML support which is disabled by default\n\nhv.extension(\"bokeh\")\n\n","type":"content","url":"/posts/2022/hurricane-ian-hvplot#imports","position":5},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl2":"Access the Data"},"type":"lvl2","url":"/posts/2022/hurricane-ian-hvplot#access-the-data","position":6},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl2":"Access the Data"},"content":"We are interested in looking at data related to Hurricane Ian, which is currently off the Florida Coast. We want to plot the expected hurricane track, and the some surface observations from buoys, or floating platforms on water!","type":"content","url":"/posts/2022/hurricane-ian-hvplot#access-the-data","position":7},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl3":"National Hurricane Center Data","lvl2":"Access the Data"},"type":"lvl3","url":"/posts/2022/hurricane-ian-hvplot#national-hurricane-center-data","position":8},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl3":"National Hurricane Center Data","lvl2":"Access the Data"},"content":"We are using a few different datasets here. Let’s start with the hurricane forecast from the National Hurricane Center, accessible from their Geographic Information Systems (GIS) webpage:\n\nNHC GIS Portal\n\nWe need to select the kmz files (\n\na Google GIS file standard for the Hurricane Ian cone and track.","type":"content","url":"/posts/2022/hurricane-ian-hvplot#national-hurricane-center-data","position":9},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl4":"The Cone","lvl3":"National Hurricane Center Data","lvl2":"Access the Data"},"type":"lvl4","url":"/posts/2022/hurricane-ian-hvplot#the-cone","position":10},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl4":"The Cone","lvl3":"National Hurricane Center Data","lvl2":"Access the Data"},"content":"A forecast cone is defines as the following, from the \n\nNational Hurricane CenterThe cone represents the probable track of the center of a tropical cyclone, and is formed by enclosing the area swept out by a set of circles (not shown) along the forecast track (at 12, 24, 36 hours, etc). The size of each circle is set so that two-thirds of historical official forecast errors over a 5-year sample fall within the circle. The circle radii defining the cones in 2022 for the Atlantic, Eastern North Pacific, and Central North Pacific basins are given in the table below.\n\nOne can also examine historical tracks to determine how often the entire 5-day path of a cyclone remains completely within the area of the cone. This is a different perspective that ignores most timing errors. For example, a storm moving very slowly but in the expected direction would still be within the area of the cone, even though the track forecast error could be very large. Based on forecasts over the previous 5 years, the entire track of the tropical cyclone can be expected to remain within the cone roughly 60-70% of the time.","type":"content","url":"/posts/2022/hurricane-ian-hvplot#the-cone","position":11},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl4":"The Best Track","lvl3":"National Hurricane Center Data","lvl2":"Access the Data"},"type":"lvl4","url":"/posts/2022/hurricane-ian-hvplot#the-best-track","position":12},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl4":"The Best Track","lvl3":"National Hurricane Center Data","lvl2":"Access the Data"},"content":"The Best Track Dataset is the best estimated track from the variety of possible scenarios.\n\n","type":"content","url":"/posts/2022/hurricane-ian-hvplot#the-best-track","position":13},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl4":"Read the Data Using Geopandas","lvl3":"National Hurricane Center Data","lvl2":"Access the Data"},"type":"lvl4","url":"/posts/2022/hurricane-ian-hvplot#read-the-data-using-geopandas","position":14},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl4":"Read the Data Using Geopandas","lvl3":"National Hurricane Center Data","lvl2":"Access the Data"},"content":"\n\nhurricane_cone = gpd.read_file(\"../data/AL092022_CONE_latest.kmz\")\nhurricane_track = gpd.read_file(\"../data/AL092022_TRACK_latest.kmz\")\n\nhurricane_track.head()\n\nOur hurricane track file includes additional point data - we just need the line (the first row, so let’s filter based on the TCInitLocation\n\nhurricane_track = hurricane_track.dropna(subset=[\"TCInitLocation\"])\nhurricane_track\n\n","type":"content","url":"/posts/2022/hurricane-ian-hvplot#read-the-data-using-geopandas","position":15},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl4":"Investigate the GeoDataframes","lvl3":"National Hurricane Center Data","lvl2":"Access the Data"},"type":"lvl4","url":"/posts/2022/hurricane-ian-hvplot#investigate-the-geodataframes","position":16},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl4":"Investigate the GeoDataframes","lvl3":"National Hurricane Center Data","lvl2":"Access the Data"},"content":"Let’s check out the geodataframe. Notice how it looks like a typical dataframe, with additional geometry information.\n\nhurricane_cone\n\nWe can create static matplotlib plots using the .plot() method.\n\nhurricane_cone.plot()\nhurricane_track.plot();\n\n","type":"content","url":"/posts/2022/hurricane-ian-hvplot#investigate-the-geodataframes","position":17},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl3":"Access NOAA Buoy Data","lvl2":"Access the Data"},"type":"lvl3","url":"/posts/2022/hurricane-ian-hvplot#access-noaa-buoy-data","position":18},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl3":"Access NOAA Buoy Data","lvl2":"Access the Data"},"content":"The National Oceanic and Atmospheric Administation (NOAA) has a buoy dataset (from the \n\nNational Data Buoy Center), which includes observations from around the world. We can access this data using \n\nsiphon, a tool developed by the Unidata Program Center which makes accessing this dataset much easier.\n\nWe can use the .lastest_observations() method from the NDBC module to access the latest data.\n\nbuoy_df = NDBC.latest_observations()\nbuoy_df\n\n","type":"content","url":"/posts/2022/hurricane-ian-hvplot#access-noaa-buoy-data","position":19},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl4":"Filter the Dataset","lvl3":"Access NOAA Buoy Data","lvl2":"Access the Data"},"type":"lvl4","url":"/posts/2022/hurricane-ian-hvplot#filter-the-dataset","position":20},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl4":"Filter the Dataset","lvl3":"Access NOAA Buoy Data","lvl2":"Access the Data"},"content":"\n\nWe are interested in locations that have water_temperature values, so we filter using .dropna()\n\nbuoy_df = buoy_df.dropna(subset=[\"water_temperature\"])\nbuoy_df.plot.scatter(x='longitude', y='latitude', c='water_temperature')\n\n","type":"content","url":"/posts/2022/hurricane-ian-hvplot#filter-the-dataset","position":21},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl2":"Plot our Data using hvPlot"},"type":"lvl2","url":"/posts/2022/hurricane-ian-hvplot#plot-our-data-using-hvplot","position":22},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl2":"Plot our Data using hvPlot"},"content":"Let’s move to interactive visualization!\n\n","type":"content","url":"/posts/2022/hurricane-ian-hvplot#plot-our-data-using-hvplot","position":23},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl3":"Plot the Hurricane Cone and Track Using hvPlot","lvl2":"Plot our Data using hvPlot"},"type":"lvl3","url":"/posts/2022/hurricane-ian-hvplot#plot-the-hurricane-cone-and-track-using-hvplot","position":24},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl3":"Plot the Hurricane Cone and Track Using hvPlot","lvl2":"Plot our Data using hvPlot"},"content":"We can do better than just static plots - let’s create an interactive one using hvPlot!\n\nhurricane_cone.hvplot(color='None',\n                      line_width=3,\n                      coastline=True,\n                      xlim=(-95, -65),\n                      ylim=(20, 40),\n                      label='NHC Forecast Cone for Hurricane Ian',\n                      projection=ccrs.PlateCarree(),\n                      features=[\"land\", \"ocean\"])\n\nAnd the same for the best estimated track\n\nhurricane_track_plot = hurricane_track.hvplot(line_color='Red',\n                                              color=\"None\",\n                                              line_width=3,\n                                              coastline=True,\n                                              xlim=(-95, -65),\n                                              ylim=(20, 40),\n                                              label='NHC Forecast Track for Hurricane Ian',\n                                              projection=ccrs.PlateCarree(),\n                                              features=[\"land\", \"ocean\"])\nhurricane_track_plot\n\nWe still need a title though, since this does not tell us what time this is valid... this information is in the dataframe!\n\nhurricane_cone.advisoryDate\n\n","type":"content","url":"/posts/2022/hurricane-ian-hvplot#plot-the-hurricane-cone-and-track-using-hvplot","position":25},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl4":"Combine our Forecast Cone and Track Plots","lvl3":"Plot the Hurricane Cone and Track Using hvPlot","lvl2":"Plot our Data using hvPlot"},"type":"lvl4","url":"/posts/2022/hurricane-ian-hvplot#combine-our-forecast-cone-and-track-plots","position":26},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl4":"Combine our Forecast Cone and Track Plots","lvl3":"Plot the Hurricane Cone and Track Using hvPlot","lvl2":"Plot our Data using hvPlot"},"content":"Let’s add the titles, and combine our plots.\n\nhurricane_track_plot = hurricane_track.hvplot(line_color='Red',\n                                              color=\"None\",\n                                              line_width=3,\n                                              coastline=True,\n                                              xlim=(-95, -65),\n                                              ylim=(20, 40),\n                                              title=f'NHC Forecast Valid: {hurricane_track.pubAdvTime.values[0]}',\n                                              label='NHC Forecast Track for Hurricane Ian',\n                                              projection=ccrs.PlateCarree()\n                                             )\n\nhurricane_cone_plot = hurricane_cone.hvplot(color='None',\n                                            line_width=3,\n                                            line_color='Black',\n                                            coastline=True,\n                                            xlim=(-95, -65),\n                                            ylim=(20, 40),\n                                            title=f\"NHC Forecast Valid {hurricane_cone.advisoryDate.values[0]}\",\n                                            label='NHC Forecast Cone for Hurricane Ian',\n                                            projection=ccrs.PlateCarree(),\n                                            features=[\"land\", \"ocean\"])\n\nhurricane_plot = (hurricane_cone_plot * hurricane_track_plot)\nhurricane_plot\n\n","type":"content","url":"/posts/2022/hurricane-ian-hvplot#combine-our-forecast-cone-and-track-plots","position":27},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl3":"Plot the Buoy Data using hvPlot","lvl2":"Plot our Data using hvPlot"},"type":"lvl3","url":"/posts/2022/hurricane-ian-hvplot#plot-the-buoy-data-using-hvplot","position":28},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl3":"Plot the Buoy Data using hvPlot","lvl2":"Plot our Data using hvPlot"},"content":"\n\nbuoy_plot = buoy_df.hvplot.points(x='longitude',\n                                  y='latitude',\n                                  c='water_temperature',\n                                  cmap='inferno',\n                                  label='NOAA Buoy Locations',\n                                  title='NOAA Buoy Water Temperature',\n                                  clabel='Temperature (degC)',\n                                  geo=True,\n                                  coastline=True,\n                                  projection=ccrs.PlateCarree(),\n                                  xlim=(-95, -65),\n                                  ylim=(20, 40),\n                                  clim=(20, 35))\nbuoy_plot\n\n","type":"content","url":"/posts/2022/hurricane-ian-hvplot#plot-the-buoy-data-using-hvplot","position":29},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl2":"Final Visualization"},"type":"lvl2","url":"/posts/2022/hurricane-ian-hvplot#final-visualization","position":30},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl2":"Final Visualization"},"content":"Let’s put it all together! We combine our plots using the * operator.\n\nhurricane_plot * buoy_plot\n\n","type":"content","url":"/posts/2022/hurricane-ian-hvplot#final-visualization","position":31},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl2":"Conclusions"},"type":"lvl2","url":"/posts/2022/hurricane-ian-hvplot#conclusions","position":32},{"hierarchy":{"lvl1":"Visualizing Hurricane Ian Using hvPlot","lvl2":"Conclusions"},"content":"Within this example, we explored visualizing data from the \n\nNational Hurricane Center, and from the \n\nNational Data Buoy Center. We encourage you to try this out on your own.\n\nIn the future, it would be nice to add other datasets, such as weather radar data, onto these plots as well.","type":"content","url":"/posts/2022/hurricane-ian-hvplot#conclusions","position":33},{"hierarchy":{"lvl1":"Moving to Illinois (Again)"},"type":"lvl1","url":"/posts/2022/moving-to-illinois","position":0},{"hierarchy":{"lvl1":"Moving to Illinois (Again)"},"content":"It has been a while since my last post! Over the past ~9 months, I started a new job at Argonne National Laboratory and relocated to the state of Illinois, more specifically the Western Suburbs of Chicago, Illinois. I work with Scott Collis, a scientist and Geospatial Computing, Innovations, and Sensing (GCIS) Department Head. He is also the inventor of the \n\nPython Atomspheric Radiation Measurement Toolkit (Py-ART), one of the go-to packages when working with weather radar data in Python.","type":"content","url":"/posts/2022/moving-to-illinois","position":1},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl2":"Closer to Home"},"type":"lvl2","url":"/posts/2022/moving-to-illinois#closer-to-home","position":2},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl2":"Closer to Home"},"content":"One of the nicest things about relocating is the proximity to my family in Wisconsin. I have gone back to see them several times already, spending quite a bit of time on Delavan Lake (shown below)\n","type":"content","url":"/posts/2022/moving-to-illinois#closer-to-home","position":3},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl2":"Reflecting on my new role"},"type":"lvl2","url":"/posts/2022/moving-to-illinois#reflecting-on-my-new-role","position":4},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl2":"Reflecting on my new role"},"content":"My new role at Argonne is similar to my old job at NCAR - I am able to develop open-source, Python software for the atmospheric science/climate community. I serve in more of a hybrid software engineer/scientist role, which has been exciting, leveraging my background in meteorology and atmospheric science. I work on both Py-ART and the \n\nAtmospheric data Community Toolkit (ACT).","type":"content","url":"/posts/2022/moving-to-illinois#reflecting-on-my-new-role","position":5},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl3":"Maintaining Core Meteorology Packages","lvl2":"Reflecting on my new role"},"type":"lvl3","url":"/posts/2022/moving-to-illinois#maintaining-core-meteorology-packages","position":6},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl3":"Maintaining Core Meteorology Packages","lvl2":"Reflecting on my new role"},"content":"One of my first tasks within \n\nPy-ART and \n\nACT development was overhauling the continuous integration system, moving towards \n\nGithub Actions as the automation tool instead of \n\nTravis-CI.\n\nI have also been adding more examples, and helped organize the first ARM/ASR Open Science Workshop, taking the lead on the Tutorial side. Tutorials covered the core scientific Python packages (ex. NumPy, Matplotlib, SciPy, Xarray), and extended to domain-specific packages such as Py-ART, ACT, and Py-SP2. Here are links to the:\n\nYoutube Recordings\n\nTutorial Website","type":"content","url":"/posts/2022/moving-to-illinois#maintaining-core-meteorology-packages","position":7},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl2":"Goals for the Near Future"},"type":"lvl2","url":"/posts/2022/moving-to-illinois#goals-for-the-near-future","position":8},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl2":"Goals for the Near Future"},"content":"We have some exciting developments coming for Py-ART...","type":"content","url":"/posts/2022/moving-to-illinois#goals-for-the-near-future","position":9},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl3":"Xarray in Py-ART","lvl2":"Goals for the Near Future"},"type":"lvl3","url":"/posts/2022/moving-to-illinois#xarray-in-py-art","position":10},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl3":"Xarray in Py-ART","lvl2":"Goals for the Near Future"},"content":"One of the main projects I am working on right now is migrating the core data model (\n\npyart.core.Radar) object to the \n\nxarray.Dataset data model. This will enable more cross-compatibility in the Pangeo ecosystem, and empower new tools to built on top of this ecosystem.","type":"content","url":"/posts/2022/moving-to-illinois#xarray-in-py-art","position":11},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl3":"Radar Cookbooks","lvl2":"Goals for the Near Future"},"type":"lvl3","url":"/posts/2022/moving-to-illinois#radar-cookbooks","position":12},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl3":"Radar Cookbooks","lvl2":"Goals for the Near Future"},"content":"Another key area of development are the \n\nProject Pythia Cookbooks (ex. \n\nRadar Cookbook), which extend the \n\nPythia Foundations content beyond the basics, diving more into domain-specific tools such as Py-ART. We link to existing foundational materials (ex. NumPy, Matplotlib) where possible, and build new content where neccessary.","type":"content","url":"/posts/2022/moving-to-illinois#radar-cookbooks","position":13},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl3":"Machine Learning Applications","lvl2":"Goals for the Near Future"},"type":"lvl3","url":"/posts/2022/moving-to-illinois#machine-learning-applications","position":14},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl3":"Machine Learning Applications","lvl2":"Goals for the Near Future"},"content":"I am also working on learning more about machine learning applications for weather and climate. I purchased a couple of new books, and plan on trying some test project using various climate projects, weather radar data, and open source tools.","type":"content","url":"/posts/2022/moving-to-illinois#machine-learning-applications","position":15},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl2":"Moving Away from Colorado"},"type":"lvl2","url":"/posts/2022/moving-to-illinois#moving-away-from-colorado","position":16},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl2":"Moving Away from Colorado"},"content":"It was tough saying goodbye to my friends and former coworkers in Colorado. Living in the Boulder area was an amazing experience, one that I will always be thankful for. I miss Tuesday night trivia at Rayback, Friday Happy Hour at Jungle, and Saturday morning hikes around Boulder’s world-class trails.\n\nI look forward to visiting my Boulder friends in the future, and I am sure work will bring me to the Boulder at some point (looking forward to AMS 2023 in Denver).","type":"content","url":"/posts/2022/moving-to-illinois#moving-away-from-colorado","position":17},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl2":"Conclusions"},"type":"lvl2","url":"/posts/2022/moving-to-illinois#conclusions","position":18},{"hierarchy":{"lvl1":"Moving to Illinois (Again)","lvl2":"Conclusions"},"content":"It has been a fun filled, productive first few months at Argonne! I have already met up new friends and coworkers around the Argonne area, and look forward to exploring the Chicago area more!\n\nArgonne’s softball league starts Wednesday, we already found a new Tuesday trivia place, and I have reconnected with some of my best friends from undergrad, who live a short drive away.\n\nI am adjusting to my new home, and as with all things, it just takes time!","type":"content","url":"/posts/2022/moving-to-illinois#conclusions","position":19},{"hierarchy":{"lvl1":"SciPy 2022 Reflection"},"type":"lvl1","url":"/posts/2022/scipy-takeaways","position":0},{"hierarchy":{"lvl1":"SciPy 2022 Reflection"},"content":"This past week, I attended my third SciPy conference, with this being the first in-person event.","type":"content","url":"/posts/2022/scipy-takeaways","position":1},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl2":"Overview of the Conference"},"type":"lvl2","url":"/posts/2022/scipy-takeaways#overview-of-the-conference","position":2},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl2":"Overview of the Conference"},"content":"The host of SciPy 2022 - the AT&T Hotel and Conference Center near the University of Texas Campus in Austin, Texas.","type":"content","url":"/posts/2022/scipy-takeaways#overview-of-the-conference","position":3},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl3":"What’s SciPy?","lvl2":"Overview of the Conference"},"type":"lvl3","url":"/posts/2022/scipy-takeaways#whats-scipy","position":4},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl3":"What’s SciPy?","lvl2":"Overview of the Conference"},"content":"The Scientific Python (SciPy) Conference is annual meeting, typically held in Austin, Texas, which brings the broad community doing science using the Python programming language together. The week long conference consists of three parts:\n\nTutorials - how to use the tools\n\nTalks - package updates and how people are using the tools\n\nBirds of a Feather - mini sessions focused on specific topics or communities\n\nSprints - gathering to contribute to projects\n\nThe conference provides an opportunity to learn about new updates within the community, meet and coordinate with other developers, and help entrain new contributors to tools within the ecosystem.","type":"content","url":"/posts/2022/scipy-takeaways#whats-scipy","position":5},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl3":"Who goes?","lvl2":"Overview of the Conference"},"type":"lvl3","url":"/posts/2022/scipy-takeaways#who-goes","position":6},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl3":"Who goes?","lvl2":"Overview of the Conference"},"content":"The conference included people interested in scientific software written in Python! This includes (but is not limited to):\n\nScientists\n\nSoftware developers\n\nData scientists\n\nPackage maintainers\n\nPackage users\n\nOutreach folks\n\nCompanies looking to hire the people listed above\n\nThere were so many scientific disciplines represented at the conference! Everything from earth science, astrophysics, material science, and biology just to name a few. The combination of all these different parts of scientific software development process (first time user to maintainers).\n\nAs a software developer, this is a great opportunity to coordinate with other contributors to the scientific Python ecosystem. As a scientist, this is a fantastic opportunity to investigate innovative ways people are using tools in the scientific python ecosystem.\n\nI am glad that many Pangeo community members attended, included folks from Columbia University, USGS, and CarbonPlan. I connected with new and old friends which is always a great time 😀.","type":"content","url":"/posts/2022/scipy-takeaways#who-goes","position":7},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl2":"The Tutorials"},"type":"lvl2","url":"/posts/2022/scipy-takeaways#the-tutorials","position":8},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl2":"The Tutorials"},"content":"I attended tutorials covering distributed + parallel computing using Dask, and  interactive plotting tutorials showcasing hvPlot and PyVista. These toolsets are essential to the atmospheric data science stack - allowing us to scale our analysis, and visualize our output.\n\nHere is a link to the repositories/content used:\n\nDask Tutorial\n\nhvPlot/holoviews Tutorial\n\nPyVista Tutorial\n\nI plan on adding a future blog post with a neat data visualization using the tools from the tutorials.","type":"content","url":"/posts/2022/scipy-takeaways#the-tutorials","position":9},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl2":"The Talks"},"type":"lvl2","url":"/posts/2022/scipy-takeaways#the-talks","position":10},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl2":"The Talks"},"content":"My favorite session (slightly biased I know) of the conference was the Earth, Geo, Ocean, and Atmosphere session. During this session, presenters showcased the latest and greatest tools including:\n\nPyGMT  - a mapping and general data visualization/analysis tool\n\nPresented by \n\nMax Jones\n\nxMIP + Pangeo tools - a toolkit for working with CMIP6 data and other climate ensembles\n\nPresented by \n\nJulius Busecke\n\nGeoCAT - a toolkit to work with geoscience data, developed at the National Center for Atmospheric Research\n\nPresented by \n\nOrhan Eroglu\n\nProject Pythia - educational resources for learning the geoscience python ecosystem\n\nPresented by \n\nKevin Tyle\n\nxGCM + Pangeo tools - enabling petabyte scale climate analysis on staggered grids\n\nPresented by \n\nTom Nicholas and \n\nJulius Busecke\n\nTobac - a flexible langrangian analysis toolkit\n\nPresented by \n\nBobby Jackson and \n\nBhupendra Raut\n\nSome of the main themes from this track was how we need flexible and performant tools. Tom’s talk dug into debugging complex Dask issues, which was solved by working with the Dask core developers. Keeping these lines of communication open and working together to solve these tough technical issues are what enable new questions to be answered from datasets like the one Tom presented - at the petabyte scale (1,000 terabytes).\n\nThere were so many other great sessions on data, maintainers tools, and keynotes about how important open and inclusive science are.\n\nI will be sure to link the videos here once they are posted on YouTube!","type":"content","url":"/posts/2022/scipy-takeaways#the-talks","position":11},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl2":"Birds of a Feather (BoFs)"},"type":"lvl2","url":"/posts/2022/scipy-takeaways#birds-of-a-feather-bofs","position":12},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl2":"Birds of a Feather (BoFs)"},"content":"The main birds of a feather session I attended was the Pangeo one (Pangeo Community Gathering).\n\nThe session started with an overview of the Pangeo community and introductions. We moved onto highlighting key features currently missing within the technological toolset, and decided to separate into smaller groups at dinner after to discuss in more detail.\n\nI am particularly interested in the outreach component - mainly how to continue to grow the community at larger organizations such as Department of Energy National Laboratories (ex. Argonne National Lab) and user facilities (ex. ARM).\n\nIf you are interested in the rest of the discussion, here are the notes!\n\nNotes to Pangeo BoF","type":"content","url":"/posts/2022/scipy-takeaways#birds-of-a-feather-bofs","position":13},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl2":"The Sprints"},"type":"lvl2","url":"/posts/2022/scipy-takeaways#the-sprints","position":14},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl2":"The Sprints"},"content":"","type":"content","url":"/posts/2022/scipy-takeaways#the-sprints","position":15},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl3":"Pangeo-Forge","lvl2":"The Sprints"},"type":"lvl3","url":"/posts/2022/scipy-takeaways#pangeo-forge","position":16},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl3":"Pangeo-Forge","lvl2":"The Sprints"},"content":"Ryan Abernathy gave an amazing talk on Pangeo-forge, a tool that enables data to be converted to analysis ready cloud-optimized (ARCO) datasets. This means thinking of datasets not necessarily at the file level, but rather at the dataset level, making the data openly available through an object store file system (think AWS Cloud).\n\nThis project had a sprint on Saturday and Sunday, which I took part in! I worked on a “recipe” which pulls radar data from the Atmospheric Radiation Measurement (ARM) user facility, merges the files together, and writes to a single Zarr store (a cloud optimized file format). I look forward to working with the ARM community to see how we can explore the benefits of ARCO data.","type":"content","url":"/posts/2022/scipy-takeaways#pangeo-forge","position":17},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl3":"Datatree + Xarray","lvl2":"The Sprints"},"type":"lvl3","url":"/posts/2022/scipy-takeaways#datatree-xarray","position":18},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl3":"Datatree + Xarray","lvl2":"The Sprints"},"content":"I initially worked with the Xarray group on investigating the new flexible index API, which enables more complex indexing within Xarray (selecting data based on non-dimensional coordinates).\n\nAn example of this would be a radar sweep. Imagine if you could select a single gate (point) from a radar dataset despite the coordinates being the angle around the radar and the distance from the radar.\n\nAfter testing out the functionality, I moved to updating my example of prototype xradar object, which utilizes datatree.  Datatree is a project supporting hierachal datasets (ex. Radar with different sweeps, or netCDF groups) in xarray. The package was built by the xarray community, with the lead develpoer being Tom Nicholas.","type":"content","url":"/posts/2022/scipy-takeaways#datatree-xarray","position":19},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl2":"How Do We Move Forward?"},"type":"lvl2","url":"/posts/2022/scipy-takeaways#how-do-we-move-forward","position":20},{"hierarchy":{"lvl1":"SciPy 2022 Reflection","lvl2":"How Do We Move Forward?"},"content":"After this conference I am energized to make progress in the following areas:\n\nContinue to grow the Pangeo community within ARM/DOE and beyond\n\nAdd our new xradar object to Py-ART\n\nCoordinate with the Pangeo community on package development related to Xarray + Datatree\n\nI look forward to moving forward with all the new tools and knowledge from this conference. I am fortunate and privileged to have had an opportunity to attend in person, and to have met so many developers and users from the scientific python community.  I am thankful that my supervisor (Scott Collis) and fellow group members at Argonne National Laboratory were able to attend too!\n\nI think this graphic from Julius’s talk sums up the key components of the Pangeo stack that enable science.\n\n\nA slide from Julius’s talk summarizing the components of the Pangeo stack enabling CMIP6 analysis.\n\nI look forward to continuing to work with the Py-ART developer community to enable to use of this same stack for radar data (replacing xMIP with Py-ART in this case), enabling the same terabyte or even petabyte workflows described by Tom.\n\nI encourage anyone remotely interested in learning more about how python empowers and enable science to attend SciPy. It was empowering to meet the people behind so many key packages in our ecosystem (SciPy, NumPy, Matplotlib, and Xarray).\n\nI am already counting down the days until SciPy 2023.\n\nIf you were interested in this post, make sure to check out Scott’s writeup too!\n\nLink to Scott Collis’s blog post on SciPy 2022","type":"content","url":"/posts/2022/scipy-takeaways#how-do-we-move-forward","position":21},{"hierarchy":{"lvl1":"AMS 2023 Reflections: Thank You Denver (and Boulder)!"},"type":"lvl1","url":"/posts/2023/post-ams-2023","position":0},{"hierarchy":{"lvl1":"AMS 2023 Reflections: Thank You Denver (and Boulder)!"},"content":"Last week, I attended the 103rd American Meteorological Society Annual Meeting in Denver Colorado. Prior to attending, I put together a blog post detailing my pre-conference thoughts and expressed a high level of excitement for this year’s conference. It did not disappoint. The week was full of meaningful connections with colleagues, leading an open science short course, and attending sessions where I learned new tools and techniques for working with atmospheric and climate datasets.","type":"content","url":"/posts/2023/post-ams-2023","position":1},{"hierarchy":{"lvl1":"AMS 2023 Reflections: Thank You Denver (and Boulder)!","lvl2":"The Short Course"},"type":"lvl2","url":"/posts/2023/post-ams-2023#the-short-course","position":2},{"hierarchy":{"lvl1":"AMS 2023 Reflections: Thank You Denver (and Boulder)!","lvl2":"The Short Course"},"content":"The week started off with our “Open Science in the Rockies: Working with ARM Data from the Surface Atmosphere Integrated Field Laboratory” short course, with over 20 attendees! A good amount of preparation went into the course, from meeting room logistics, inviting speakers, and testing the cyberinfrastructure that would allow participants to analyze large datasets while on a limited conference internet network. The course started with an overview of the SAIL field campaign, quickly diving into ways to access the data and analyze the datasets using open-source tools funded and supported by ARM! We also covered advanced data visualization techniques using the Pangeo stack, including using Xarray and the Holoviews tools to visualize an entire day’s worth of high spatiotemporal cloud radar data.\n\nMy favorite part of the course covering that last section. One participant even used the open-source cookbooks as inspiration for his talk later in the week during the SAIL-specific AMS session, acknowledging where he had learned how to create the figure. Enabling the science community is what these courses are all about.\n\nHere is a group picture of the attendees and instructors:","type":"content","url":"/posts/2023/post-ams-2023#the-short-course","position":3},{"hierarchy":{"lvl1":"AMS 2023 Reflections: Thank You Denver (and Boulder)!","lvl2":"The Conference"},"type":"lvl2","url":"/posts/2023/post-ams-2023#the-conference","position":4},{"hierarchy":{"lvl1":"AMS 2023 Reflections: Thank You Denver (and Boulder)!","lvl2":"The Conference"},"content":"As a member of the Environmental Information Processing Technologies committee, I helped co-chair quite a few sessions, with topics ranging from tools for research to operations to part of the AMS Python Symposium! One of the more notable moments during the Python symposium was Monday afternoon’s session, where Tom Nicholas (developer of several Pangeo-related packages) asked the room “Who here has used and is familiar with Xarray”? Almost everyone in the room raised their hand. This contrasts with last in-person meeting, the 100th AMS Annual Meeting in Boston, where there were still quite a few people working on adopting Xarray within their workflows. It was also astonishing how many presentations explicitly mentioned their tools are built around Xarray. Another common theme during the Python Symposium was the impact Project Pythia is having on the community, and how many presenters are interested in contributing cookbooks or improving the existing content.\n\nAfter each day of sessions, attendees flocked to different social events, with most focused-on alumni or general AMS-hosted networking opportunities. The Valparaiso University meteorology reception on Monday was my favorite social event that week. I connected with current undergraduates, discussing with them their career goals and what their plans after Valpo are, as well as reconnecting with alumni through the years. It’s amazing how much this event has grown since my first AMS Valpo reception in Austin in 2018.","type":"content","url":"/posts/2023/post-ams-2023#the-conference","position":5},{"hierarchy":{"lvl1":"AMS 2023 Reflections: Thank You Denver (and Boulder)!","lvl2":"The Pangeo Working Meeting"},"type":"lvl2","url":"/posts/2023/post-ams-2023#the-pangeo-working-meeting","position":6},{"hierarchy":{"lvl1":"AMS 2023 Reflections: Thank You Denver (and Boulder)!","lvl2":"The Pangeo Working Meeting"},"content":"Something new at this year’s AMS Annual Meeting was the post-conference working meeting, where members of the Pangeo community gathered to collaborate on projects. The day was structured as a collection of breakouts, focused around:\n\nXarray and Friends (Xarray and associated packages)\n\nProject Pythia (Educational cookbooks and feedback on content)\n\nPangeo Forge (Analysis Ready Cloud Optimized (ARCO) data conversion)\n\nXbatcher (Toolkit for generating AI/ML batches from Xarray data structures)\nIn addition to the topics listed above, we had even smaller breakouts related to improving documentation and tutorials when it comes to Xarray + Dask (at the intermediate level), and fixed some bugs in Intake-ESM!","type":"content","url":"/posts/2023/post-ams-2023#the-pangeo-working-meeting","position":7},{"hierarchy":{"lvl1":"AMS 2023 Reflections: Thank You Denver (and Boulder)!","lvl2":"A Weekend in Boulder"},"type":"lvl2","url":"/posts/2023/post-ams-2023#a-weekend-in-boulder","position":8},{"hierarchy":{"lvl1":"AMS 2023 Reflections: Thank You Denver (and Boulder)!","lvl2":"A Weekend in Boulder"},"content":"I decided to extend the trip by a couple of days, staying near Boulder Saturday and Sunday. Some of my best friends still live in that region. Friday night, I joined some friends at Rayback Collective, finding dinner at one of the local food trucks. Saturday was an ideal day: breakfast at my favorite diner in Downtown Louisville (B.O.B.’s Diner), hiking along Mount Sanitas, and lunch (and beverages) at Avery Brewing Company, followed by a night along Pearl Street. Reconnecting with my friends in Colorado was both restorative and relaxing! I had smooth travel day on Sunday, spending some time at the new lounging area at the end of the A terminal at Denver’s airport.\n\nHere is a picture from my Boulder adventure:","type":"content","url":"/posts/2023/post-ams-2023#a-weekend-in-boulder","position":9},{"hierarchy":{"lvl1":"AMS 2023 Reflections: Thank You Denver (and Boulder)!","lvl2":"Conclusions"},"type":"lvl2","url":"/posts/2023/post-ams-2023#conclusions","position":10},{"hierarchy":{"lvl1":"AMS 2023 Reflections: Thank You Denver (and Boulder)!","lvl2":"Conclusions"},"content":"The 103rd AMS Annual Meeting was successful. Between the short courses, symposiums, and post-conference working meeting, I feel as though real progress was made in terms of open science this week. I am thankful Denver is on the new rotation of meeting locations (extending through 2032). It is an amazing city, with a convenient colocation of hotels, restaurants, collaborators, and friends.","type":"content","url":"/posts/2023/post-ams-2023#conclusions","position":11},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection"},"type":"lvl1","url":"/posts/2023/pre-ams-2023","position":0},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection"},"content":"It is hard to believe that tomorrow I will hop on a plane for AMS 2023. Am I prepared for all of my presentations, co-chair obligations, and general travel logistics? Absolutely not. I am however excited to reconnect with the weather community in beautiful Colorado, with this being the first in-person AMS Annual Meeting since January 2020.\n\nWhile I typically reflect on conferences after the event, I wanted to take this as an opportunity to express why the American Meteorological Society (AMS) Annual Meeting is such an amazing event, how it has influenced my career (and my life in general), as well as some general advice for the week!","type":"content","url":"/posts/2023/pre-ams-2023","position":1},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl2":"Why I Love the AMS Annual Meeting"},"type":"lvl2","url":"/posts/2023/pre-ams-2023#why-i-love-the-ams-annual-meeting","position":2},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl2":"Why I Love the AMS Annual Meeting"},"content":"The AMS Annual Meeting is one the largest (if not the largest gathering) of meteorologists/atmospheric scientists in the world. The entire event is structured into two main parts:\n\nThe Student Conference + Short Courses (Saturday and Sunday)\n\nThe Annual Meeting (Sunday evening through Thursday)","type":"content","url":"/posts/2023/pre-ams-2023#why-i-love-the-ams-annual-meeting","position":3},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl3":"The Student Conference","lvl2":"Why I Love the AMS Annual Meeting"},"type":"lvl3","url":"/posts/2023/pre-ams-2023#the-student-conference","position":4},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl3":"The Student Conference","lvl2":"Why I Love the AMS Annual Meeting"},"content":"As a student, the first two days were my favorite. The student conference planning committee does an incredible job incorporating networking, presentations, and professional development into the conference experiment. There is also a career fair, which features graduate schools, employers offering internships, and even job opportunities! As an undergraduate student, this is likely the most value you will get out of conference out there in terms of opening doors for future careers in the field.","type":"content","url":"/posts/2023/pre-ams-2023#the-student-conference","position":5},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl3":"The Annual Meeting","lvl2":"Why I Love the AMS Annual Meeting"},"type":"lvl3","url":"/posts/2023/pre-ams-2023#the-annual-meeting","position":6},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl3":"The Annual Meeting","lvl2":"Why I Love the AMS Annual Meeting"},"content":"My first annual meeting (the 98th Annual Meeting, hosted in Austin, Texas in 2018) was overwhelming to say the least. The meeting, realistically, is a meeting with tens of smaller meetings in it. As someone who had recently taken an in-depth Python for Meteorology course at Valparaiso, I figured I would stop by the Python Symposium (yes, that’s a thing!).\n\nThe Python Symposium is where I found my community. The talks covered a broad range of topics, from tropical cyclones to creating a new distributed computing library. I was hooked. Talking with other attendees of these sessions made me realize that there are numerous opportunities out there for those interested in meteorology + software development.\n\nThe Python Symposium is my favorite part of the meeting, and I look forward to my first in-person oral presentation at this year’s meeting, where I will discuss Open Science Cookbooks related to the Department of Energy Atmospheric Radiation Measurement (ARM) user facility.","type":"content","url":"/posts/2023/pre-ams-2023#the-annual-meeting","position":7},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl2":"How AMS Has Influenced My Career"},"type":"lvl2","url":"/posts/2023/pre-ams-2023#how-ams-has-influenced-my-career","position":8},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl2":"How AMS Has Influenced My Career"},"content":"","type":"content","url":"/posts/2023/pre-ams-2023#how-ams-has-influenced-my-career","position":9},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl3":"Mentorship Program","lvl2":"How AMS Has Influenced My Career"},"type":"lvl3","url":"/posts/2023/pre-ams-2023#mentorship-program","position":10},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl3":"Mentorship Program","lvl2":"How AMS Has Influenced My Career"},"content":"The AMS, in general, has been a critical component of my professional development and transition into a career in meteorology. After my first annual meeting, I enrolled in the mentorship program (AMS 360) offered through the society, where I was paired with Jared who now works at the National Center for Environmental Information (NCEI). Jared has served as an amazing mentor, helping me figure out how to get involved with the society and navigate the graduate school process. We still try to find time to catch up, even after the program ended.","type":"content","url":"/posts/2023/pre-ams-2023#mentorship-program","position":11},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl3":"Internships and Grad School","lvl2":"How AMS Has Influenced My Career"},"type":"lvl3","url":"/posts/2023/pre-ams-2023#internships-and-grad-school","position":12},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl3":"Internships and Grad School","lvl2":"How AMS Has Influenced My Career"},"content":"The 99th Annual Meeting in 2019 was where I first met the Unidata team! For those who are not familiar, Unidata is a program which serves a critical role in developing and maintaining critical cyberinfrastructure, tools, and educational efforts for the geoscience community. They are an organization which supports:\n\nMetPy\n\nNetCDF\n\nLDM\n\nTHREDDS (data server)\n\nSo many other tools + services!\n\nI interned with Unidata the summer between undergraduate and graduate school, where I worked with the core MetPy Developers (mainly Ryan May) on implementing METAR support in MetPy! This summer experience was what solidified my decision to pursue a career in scientific software development.\n\nI also met with my future graduate school advisor (Jeff Trapp from the University of Illinois Urbana-Champaign) at the AMS Annual Meeting in 2019, along with future graduate school officemates! Hopping around to the different graduate school receptions, as an undergraduate, gave me the opportunity to connect with current graduate students, one of the deciding factors for my eventual decision.","type":"content","url":"/posts/2023/pre-ams-2023#internships-and-grad-school","position":13},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl2":"Advice for Those Attending"},"type":"lvl2","url":"/posts/2023/pre-ams-2023#advice-for-those-attending","position":14},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl2":"Advice for Those Attending"},"content":"One of my best friends from graduate school, Randy Chase, put together a great thread of advice for those attending their first AMS Annual Meeting! I suggest checking it out.\n\nRandy’s Thread\n\nSome other advice I would put out there is:\n\nAs a student, make sure to attend everything you can at the Student Conference! It is such an amazing part of the experience.\n\nFind your community. Like I did with the AMS Python Symposium, it is a large enough meeting that you will find people interested in the same topics as you\n\nYou should also talk to people at these sessions! While it can be scary as an introverted person, I encourage you to make those connections.\n\nHydrate, and if you are coffee drinker, don’t forget coffee too\n\nI accidentally gave up coffee at my first AMS in Austin (yes, I had headaches most of the week)\n\nTry to follow those “normal” routines where you can, and don’t be afraid to skip some sessions if you need to\n\nAvoid non-meeting tasks where possible\n\nIf you are able to, use this as opportunity to fully engage with the meeting, putting off some of those emails or slack messages until you get back to the office or school","type":"content","url":"/posts/2023/pre-ams-2023#advice-for-those-attending","position":15},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl2":"Conclusions"},"type":"lvl2","url":"/posts/2023/pre-ams-2023#conclusions","position":16},{"hierarchy":{"lvl1":"Pre-AMS 2023 Reflection","lvl2":"Conclusions"},"content":"A few shameless plugs first...\n\nIf you are interested in applying for the Unidata Internship Program, here is the link to apply (Deadline of January 19):\n\nUnidata Summer Internship\n\nOr if you are interested in working with our team on software + open science at Argonne National Laboratory, you can apply here (Deadline of January 10):\n\nSULI Internship\n\nExcited is an understatement. I look forward to AMS 2023 finally being here. I am counting down the hours until we teach our short course on Sunday, and the AMS Python Symposium kicks off on Monday afternoon. I look forward to Monday night’s Valpo Meteorology Alumni Reception. Most of all, I am excited for so many people in the weather community to experience their first meeting, and for everyone else to reconnect with the AMS community they have missed so much.","type":"content","url":"/posts/2023/pre-ams-2023#conclusions","position":17},{"hierarchy":{"lvl1":"Interactive Weathergami"},"type":"lvl1","url":"/posts/2023/weathergami-chicago","position":0},{"hierarchy":{"lvl1":"Interactive Weathergami"},"content":"","type":"content","url":"/posts/2023/weathergami-chicago","position":1},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl2":"Motivation"},"type":"lvl2","url":"/posts/2023/weathergami-chicago#motivation","position":2},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl2":"Motivation"},"content":"Scorigami is an interesting concept. It’s an event in sports where a final score has never happened in its history. For example, in the \n\nNational Football League, a 20-17 score has happened over 285 times, but a 70-20 score has only happened once. When the Miami Dolphins beat the Denver Broncos 70-20 on September 24th, 2023, that was considered a scorigami!\n\nWell, inspired by this, Jonathan Kahl wrote an \n\narticle in the Bulletin of the American Meteorological Society describing the concept of ‘WeatherGami’, utilizing the days Maximum and Minimum temperature at a given area. Since \n\nNOAA NCEI holds all of the worlds weather data, it makes sense to see how WeatherGami works on their station database. This code reproduces the results!\n\nJared Rennie then wrote \n\na notebook reproducing similar figures in a notebook, and I modified that notebook to add in some additional plotting tools to make plots interactive + easily configure a dashboard! In this example, I am interested in how common a combination of:\n\nhigh temperature of 46 degrees Fahrenheit\n\nlow temperature of 33 degrees Fahrenheit\nis at Chicago O’Hare airport.","type":"content","url":"/posts/2023/weathergami-chicago#motivation","position":3},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl2":"What You Need"},"type":"lvl2","url":"/posts/2023/weathergami-chicago#what-you-need","position":4},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl2":"What You Need"},"content":"First off, the entire codebase works in Python 3. In addition to base Python, you will need the following packages installed:\n\nrequests (to access the api)\n\npandas (to slice annd dice the data)\n\nmatplotlib (to plot!)\n\ncmweather (for neat weather colorbars)\n\nholoviews + hvplot (for interactive plotting)\n\nThe “easiest” way is to install these is by installing \n\nanaconda, and then applying \n\nconda-forge. Afterward, then you can install the above packages.conda install -c conda-forge requests pandas matplotlib cmweather holoviews hvplot","type":"content","url":"/posts/2023/weathergami-chicago#what-you-need","position":5},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl2":"Importing Packages"},"type":"lvl2","url":"/posts/2023/weathergami-chicago#importing-packages","position":6},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl2":"Importing Packages"},"content":"Assuming you did the above, it should (in theory) import everything no problem:\n\n# Import packages\nimport json,requests,sys\nimport pandas as pd\nimport hvplot.pandas\nimport numpy as np\nimport cmweather\nimport holoviews as hv\nimport sys\nimport panel as pn\nhv.extension('bokeh')\n\n","type":"content","url":"/posts/2023/weathergami-chicago#importing-packages","position":7},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl2":"Accessing the Data"},"type":"lvl2","url":"/posts/2023/weathergami-chicago#accessing-the-data","position":8},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl2":"Accessing the Data"},"content":"\n\n","type":"content","url":"/posts/2023/weathergami-chicago#accessing-the-data","position":9},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl3":"Set Your Desired Location and Test Temperatures","lvl2":"Accessing the Data"},"type":"lvl3","url":"/posts/2023/weathergami-chicago#set-your-desired-location-and-test-temperatures","position":10},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl3":"Set Your Desired Location and Test Temperatures","lvl2":"Accessing the Data"},"content":"To access the data, we will be utilizing the \n\nApplied Climate Information System (ACIS) API, which is a quick and easy way to access our station data without downloading data locally (streaming!). Now we need to know what station to get data for. The ACIS API accepts all sorts of IDs, including:\n\nFAA (i.e. AVL)\n\nghcn (i.e. USW00003812)\n\nThreadEx (i.e. AVLthr)\n\nIf you’re not sure, you can refer to the API documentation above. We also need a maximum/minimum combo for us to check against the database. And finally we need to give you credit for the image that is created at the end.\n\nChange the arguments below to your liking\n\n# Insert Arguments Here\nstationID = 'ORD'\ninTmax= 46.\ninTmin= 33.\nauthor='Max Grover'\n\nThe rest of the code should work without making any changes to it, but if you’re interested, keep on reading to see how the sausage is made.\n\nThis next block of code will attempt to access the data we want from the ACIS API. The API is publicly available, but sometimes there are hiccups when getting the data. We tried to account for this with a try/exept in this code block and it will let you know if it fails after 3 seconds. If this happens, wait a minute, then try again.\n\ndef get_data(stationID, inTmax=inTmax, inTmin=inTmin):\n\n    # Build JSON to access ACIS API (from https://www.rcc-acis.org/docs_webservices.html)\n    acis_url = 'http://data.rcc-acis.org/StnData'\n    payload = {\n    \"output\": \"json\",\n    \"params\": {\"elems\":[{\"name\":\"maxt\",\"interval\":\"dly\",\"prec\":1},{\"name\":\"mint\",\"interval\":\"dly\",\"prec\":1}],\n               \"sid\":stationID,\n               \"sdate\":\"por\",\n               \"edate\":\"por\"\n              } \n    }\n\n    # Make Request\n    try:\n        r = requests.post(acis_url, json=payload,timeout=3)\n        acisData = r.json()\n        print(\"SUCCESS!\")\n    except Exception as e:\n        sys.exit('\\nSomething Went Wrong With Accessing API after 3 seconds, Try Again')\n    \n    # Get Station Info\n    stationName=acisData['meta']['name'].title()\n    stationState=acisData['meta']['state']\n\n    # Convert data into Pandas DataFrame\n    df = pd.DataFrame(acisData['data'],\n                      columns=['Date','Tmax','Tmin'],\n                     )\n\n    # Convert the datatypes for Tmax/Tmin to be floats\n    df[\"Tmax\"] = df.Tmax.astype(float)\n    df[\"Tmin\"] = df.Tmin.astype(float)\n\n    # Make sure data \n    return df, stationName, stationState\n\nIf it says “SUCCESS!” then congrats you got the data!","type":"content","url":"/posts/2023/weathergami-chicago#set-your-desired-location-and-test-temperatures","position":11},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl3":"Let’s check the data!","lvl2":"Accessing the Data"},"type":"lvl3","url":"/posts/2023/weathergami-chicago#lets-check-the-data","position":12},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl3":"Let’s check the data!","lvl2":"Accessing the Data"},"content":"How does it look? Well the data comes back as a JSON, which can be a little confusing to look at, so let’s extract the information we need, and reorganize it a bit.\n\nFirst, the JSON has a ‘meta’ key and a ‘data’ key. The ‘meta’ key gets us info like station name, latitude, longitude, etc. And ‘data’ is the actual data we requested. So let’s get some station info, and convert the data into a pandas dataframe, which makes it easier to see.\n\ndf, stationName, stationState = get_data(stationID)\nprint(\"\\nSuccessfully Orgainzed Data for: \",stationName,',',stationState)\nprint(df)\n\nSometimes people want to know what the station’s period of record is, so let’s get that info.\n\nstationStart=df.iloc[[0]]['Date'].values[0][0:4]\nstationEnd=df.iloc[[-1]]['Date'].values[0][0:4]\nprint(\"Period of Record: \",stationStart,\"-\",stationEnd)\n\n","type":"content","url":"/posts/2023/weathergami-chicago#lets-check-the-data","position":13},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl3":"Cool, but is it a WeatherGami?","lvl2":"Accessing the Data"},"type":"lvl3","url":"/posts/2023/weathergami-chicago#cool-but-is-it-a-weathergami","position":14},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl3":"Cool, but is it a WeatherGami?","lvl2":"Accessing the Data"},"content":"Let’s find out! We can use some pandas calls to see if our max/min input has happened in the record before. This code block will tell you if it’s a WeatherGami or not. If not, it will tell you the other times it has happened in the record. Here, we define a WeatherGami as either happening once before, or not at all.\n\n# Now Find if the Tmax/Tmin combo has happened in the record before (ie WeatherGami).\nwgTest=df.loc[(df['Tmax'] == inTmax) & (df['Tmin']==inTmin)].sort_values('Date', ascending=False)\n\nif len(wgTest) == 0:\n    wgResult=\"It's a WeatherGami!\"\n    print(inTmax,'/',inTmin,': ',wgResult)\n    print(\"It has never happened before!\")\nelif len(wgTest) == 1:\n    wgResult=\"It's a WeatherGami!\"\n    print(inTmax,'/',inTmin,': ',wgResult)\n    print(\"It has happened \",len(wgTest),\" time before\")\n    print(wgTest)\nelse:\n    wgResult=\"It's NOT a WeatherGami!\"\n    print(inTmax,'/',inTmin,': ',wgResult)\n    print(\"It has happened \",len(wgTest),\" times before\")\n    print(wgTest)\n\nThe other thing we might want to know is the frequency, or percentage of time a max/min combo occurrs. The followig code block does this for all combinations, and prints out the most common. We also need to weed out missing data at this point, which is recogized as ‘M’ by the API\n\nfrequency_counts = df.groupby(['Tmax', 'Tmin']).size().reset_index(name='Frequency')\nfrequency_counts['Percentage'] = (frequency_counts['Frequency'] / len(df)) * 100\nfrequency_counts=frequency_counts.loc[(frequency_counts['Tmax']!='M') & (frequency_counts['Tmin']!='M')].sort_values('Percentage', ascending=True)\nfrequency_counts\n\n# Get Frequency and Percentage Info needed for Plotting\nfrequency_counts = df.groupby(['Tmax', 'Tmin']).size().reset_index(name='Frequency')\nfrequency_counts['Percentage'] = (frequency_counts['Frequency'] / len(df)) * 100\n\n# Remove Missing Data\nfrequency_counts=frequency_counts.loc[(frequency_counts['Tmax']!='M') & (frequency_counts['Tmin']!='M')].sort_values('Percentage', ascending=True)\n\n# Get Frequency of input tmax/tmin and most frequent\ncurrFreq=frequency_counts.loc[(frequency_counts['Tmax'] == inTmax) & (frequency_counts['Tmin']==inTmin)]\nif len(currFreq)==0:\n    currFreq=str(inTmax)+'/'+str(inTmin)+': '+wgResult+' (It has never happened before!)'\nelif currFreq['Frequency'].values[0]==1:\n    currFreq=str(inTmax)+'/'+str(inTmin)+': '+wgResult+' ('+str(currFreq.iloc[-1]['Frequency'])+' Occurrence)'\nelse:\n    currFreq=str(inTmax)+'/'+str(inTmin)+': '+wgResult+' ('+str(currFreq.iloc[-1]['Frequency'])+' Occurrences)'\nmostFreq=str(frequency_counts.iloc[-1]['Tmax'])+'/'+str(frequency_counts.iloc[-1]['Tmin'])+' ('+str(frequency_counts.iloc[-1]['Frequency'])+' Occurrences)'\n\nprint('Most Frequent: ',mostFreq)\n\nNow for the fun part...","type":"content","url":"/posts/2023/weathergami-chicago#cool-but-is-it-a-weathergami","position":15},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl3":"Plotting the data!","lvl2":"Accessing the Data"},"type":"lvl3","url":"/posts/2023/weathergami-chicago#plotting-the-data","position":16},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl3":"Plotting the data!","lvl2":"Accessing the Data"},"content":"This block of code will take the max/min combos and plot it, and color by frequency. A red dot will also plot with the max/min combo given as an input.\n\n# Determine maximum/minimum ranges\nymin=int(5 * round(float((min(frequency_counts['Tmin'].values) - 10))/5))\nymax=int(5 * round(float((max(frequency_counts['Tmin'].values) + 10))/5))\nxmin=int(5 * round(float((min(frequency_counts['Tmax'].values) - 10))/5))\nxmax=int(5 * round(float((max(frequency_counts['Tmax']) + 10))/5))\n\n# Create a heatmap with adjustable parameters\nheatmap = frequency_counts.hvplot.heatmap('Tmax',\n                                          'Tmin',\n                                          C='Percentage',\n                                          height=300,\n                                          width=400,\n                                          reduce_function=np.mean,\n                                          ylabel=r'Minimum Temperature (°F)',\n                                          xlabel=r'Maximum Temperature (°F)',\n                                          xlim=(xmin, xmax),\n                                          ylim=(ymin, ymax),\n                                          cmap='HomeyerRainbow',\n                                          clabel='Frequency (%)',\n                                          alpha=.6,\n                                          title='WeatherGami For \\n'+stationName+', '+stationState\n                                         ).opts(show_grid=True)\n\n# Add the red dot for the maximum/minimum\nfeature = hv.Points([(float(inTmax), float(inTmin))]).opts(color='red')\n\n# Add different labels to the plot\nattribution = hv.Text(xmax-30, ymin+10, f\"Source: ACIS \\n  Generated by {author} \\n Inspired By Kahl (2023) \\n and Jared Renee\", fontsize=4)\nstatus = hv.Text(xmin+40, ymax-30, currFreq+'\\nMost Common: '+mostFreq+'\\nPeriod of Record= '+str(stationStart)+'-'+str(stationEnd), fontsize=4)\n\n# Combine the first part of the plot by *\nfinal_plot = heatmap * attribution * status * feature\n\n# Add a table for the \"hits\"\ntable_results = wgTest.hvplot.table(title=f'Weathergami \"Hits\" \\n (High: {inTmax} °F, Low: {inTmin} °F)',\n                                            columns='Date',\n                                            sortable=True,\n                                            selectable=True,\n                                            fontsize=8,\n                                            height=300,\n                                            width=200)\n    \n(final_plot + table_results).cols(2)\n\n","type":"content","url":"/posts/2023/weathergami-chicago#plotting-the-data","position":17},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl2":"Conclusions"},"type":"lvl2","url":"/posts/2023/weathergami-chicago#conclusions","position":18},{"hierarchy":{"lvl1":"Interactive Weathergami","lvl2":"Conclusions"},"content":"This was a really fun blog post/notebook to put together! Weathergami plots can be interesting to create and visualize, and I hope this helps with getting started with the hvPlot stack with weather/climate data! In future iterations of this dashboard, I hope to add widgets to select the temperatures of interest, as well as a drop down menu for the various sites available.","type":"content","url":"/posts/2023/weathergami-chicago#conclusions","position":19},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 1 - Landing in Nantucket"},"type":"lvl1","url":"/posts/2023/wfip3-day1","position":0},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 1 - Landing in Nantucket"},"content":"","type":"content","url":"/posts/2023/wfip3-day1","position":1},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 1 - Landing in Nantucket","lvl2":"Overview of WFIP3"},"type":"lvl2","url":"/posts/2023/wfip3-day1#overview-of-wfip3","position":2},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 1 - Landing in Nantucket","lvl2":"Overview of WFIP3"},"content":"Today was the first day of my trip focused on deploying instruments from Argonne National Laboratory (ANL) (based in Lemont, Illinois), to the East Coast of the United States for the 3rd Wind Forecast Improvement Project (WFIP3). The project aims to improve wind forecasting ability within models, using both models and observations focused on offshore wind farms in the greater Boston, Massachusetts region. Argonne National Laboratory has a collection of instruments, most of which usually reside at the Argonne Testbed for Multiscale Observational Science (ATMOS) \n\nhttps://​www​.anl​.gov​/evs​/atmos, which can be deployed for different scientific projects! Instruments at Argonne were deployed for previous Wind Forecast Improvement Projects.\n\nThe field sites are outlined in the graphic below, which can be found on the project website (\n\nhttps://​www2​.whoi​.edu​/site​/wfip3​/field​-observations/)  )","type":"content","url":"/posts/2023/wfip3-day1#overview-of-wfip3","position":3},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 1 - Landing in Nantucket","lvl2":"Day 1 Activities"},"type":"lvl2","url":"/posts/2023/wfip3-day1#day-1-activities","position":4},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 1 - Landing in Nantucket","lvl2":"Day 1 Activities"},"content":"Today was a travel day for the most part. We flew from O’Hare (Chicago) to Logan airport (Boston). We rented a car, grabbed some last minute supplies, and drove to the harbor to catch the ferry to the island of Nantucket, Massachusetts.\n\nThis is an image of our arrival in Nantucket.\n\nOnce on the island, we met up with collaborators from other research institutions (Pacific Northwest National Laboratory and Woods Hole Oceanographic Institute), who drove us to the field site, located on the southern portion of the island. There was a beautiful sunset as we reviewed the plan for tomorrow.\n\nWe grabbed dinner after checking into the hotel, walking to Brotherhood of Thieves, only a few minutes away. They had phenomenal seafood options, including the traditional lobster roll with clam chowder appetizer.\n\nThis was a great way to end the day, and I look forward to helping to install instruments tomorrow, starting the initial data collection process.","type":"content","url":"/posts/2023/wfip3-day1#day-1-activities","position":5},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 2 - Installation Begins!"},"type":"lvl1","url":"/posts/2023/wfip3-day2","position":0},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 2 - Installation Begins!"},"content":"Today was the first day of real installation work! We started with a quick breakfast at the hotel, then drove to the field site at sunrise (shown below).","type":"content","url":"/posts/2023/wfip3-day2","position":1},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 2 - Installation Begins!","lvl2":"Installing the Tower"},"type":"lvl2","url":"/posts/2023/wfip3-day2#installing-the-tower","position":2},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 2 - Installation Begins!","lvl2":"Installing the Tower"},"content":"We started by installing the meteorology tower, which includes sensors that measure wind speed, wind direction, temperature, precipitation, and moisture. The tower extends to over 10 meters (over 32 feet), and looks similar to a cellular communication tower! Joe O’Brien (oneo f my colleagues at Argonne National Laboratory) worked together to assemble the tower, connect the three main sections, and attach instruments! While we did not finish the complete setup of the tower today, we made great progress and will wrap up the installation tomorrow morning.","type":"content","url":"/posts/2023/wfip3-day2#installing-the-tower","position":3},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 2 - Installation Begins!","lvl2":"My AGU Talk"},"type":"lvl2","url":"/posts/2023/wfip3-day2#my-agu-talk","position":4},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 2 - Installation Begins!","lvl2":"My AGU Talk"},"content":"I presented an oral presentation remotely for the American Geophysical Union Annual Meeting, which took place in San Francisco, California. Fortunately there was a remote option, which enabled me to present remotely at the field site in Nantucket! I presented on “Open Urban Science Instrument Cookbooks”, highlighting the work we have done with the Community Research on Urban Climate Science (CROCUS) project. The internet only cut out once during the session - and I was still able to engage in the discussion about open science for the geoscience community!","type":"content","url":"/posts/2023/wfip3-day2#my-agu-talk","position":5},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 2 - Installation Begins!","lvl2":"The Sodar"},"type":"lvl2","url":"/posts/2023/wfip3-day2#the-sodar","position":6},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 2 - Installation Begins!","lvl2":"The Sodar"},"content":"The meteorological tower was not the only set of instruments we deployed/are deploying at Nantucket. The other core instrument we are responsible for is the Sonic Detection and Ranging Instrument (SODAR). The SODAR provides a vertical profile of wind speed, direction, and temperature up to several hundred meters above the surface! This enables measurements far above what a tower could measure, a benefit common to remote sensing instruments like this. The SODAR sends an audible “chirp” vertically, and measures the sound that returns back to the instrument, which can be converted to temperature and wind estimates. For this instrument, we leveled the wooden palette, connected the side panels, and anchored the instrument to the ground.","type":"content","url":"/posts/2023/wfip3-day2#the-sodar","position":7},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 2 - Installation Begins!","lvl2":"Dinner (and Drinks)"},"type":"lvl2","url":"/posts/2023/wfip3-day2#dinner-and-drinks","position":8},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Day 2 - Installation Begins!","lvl2":"Dinner (and Drinks)"},"content":"We finished the day by stopping at a local brewery, Cisco Brewing Company. They had a great beer selection and a taco truck. Dinner also came with a show - with a local folk band performing as we finished our taco bowls and burritos. It was a relaxing way to finish the day, and we traveled back to the hotel after closing out. As mentioned earlier, we need to finish a few more tasks at the site tomorrow (mainly related to the tower), then we travel to Martha’s Vineyard tomorrow evening, where we plan to set up an instrument at our second field site.","type":"content","url":"/posts/2023/wfip3-day2#dinner-and-drinks","position":9},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Days 3-4: A Full Weekend"},"type":"lvl1","url":"/posts/2023/wfip3-day3-4","position":0},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Days 3-4: A Full Weekend"},"content":"","type":"content","url":"/posts/2023/wfip3-day3-4","position":1},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Days 3-4: A Full Weekend","lvl2":"The Nantucket Tower"},"type":"lvl2","url":"/posts/2023/wfip3-day3-4#the-nantucket-tower","position":2},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Days 3-4: A Full Weekend","lvl2":"The Nantucket Tower"},"content":"We had a busy weekend deploying more instruments that are collecting data for the field observation portion of the 3rd Department of Energy funded Wind Forecast Improvement Project, which focuses on offshore wind regions off the coast of New England. On Saturday, we spent a bulk of the day putting the final touches on the 10 meter meteorology tower, shown below.\n\nThis meteorology tower includes sonic anemometers (the big claw machine looking devices) at 10 meters (right portion of the picture) and 5 meters (left portion of the picture). These devices send ultrasonic sounds from each of those claws, and measure how the sound interacts with the air, which gives an estimate of the wind direction and speed, in all directions. These high resolution measurements are helpful when looking at how the surface interacts with the air above it, a key focus for this field experiment!\n\nWhile we were able to install all of the instruments on the tower, and test that they were collecting data, we were not able to fully raise the tower. We plan to return later this week (hopefully) to raise the tower.","type":"content","url":"/posts/2023/wfip3-day3-4#the-nantucket-tower","position":3},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Days 3-4: A Full Weekend","lvl2":"Traveling to Martha’s Vineyard"},"type":"lvl2","url":"/posts/2023/wfip3-day3-4#traveling-to-marthas-vineyard","position":4},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Days 3-4: A Full Weekend","lvl2":"Traveling to Martha’s Vineyard"},"content":"After securing all of our instruments at Nantucket, we traveled to the docks to catch the ferry back to the mainland, en route to our next site in Martha’s Vineyard. Before hopping on the boat, we grabbed a quick bite at Stubby’s, which had tasty sandwiches to go! The outside was well decorated, the food was phenomenal, and service was quick!\n\nAfter arriving in Hyannis, we drove to catch the next ferry at Woods Hole. Unfortunately we didn’t make the earlier ferry, so we needed to take the next one, which led to us arriving later than expected in Oak Bluffs, a town in Martha’s Vineyard. This is also why I did not have a chance to put together a blog post last night! I was quite exhausted.","type":"content","url":"/posts/2023/wfip3-day3-4#traveling-to-marthas-vineyard","position":5},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Days 3-4: A Full Weekend","lvl2":"Onto the Martha’s Vineyard Site"},"type":"lvl2","url":"/posts/2023/wfip3-day3-4#onto-the-marthas-vineyard-site","position":6},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Days 3-4: A Full Weekend","lvl2":"Onto the Martha’s Vineyard Site"},"content":"I started the morning with a nice walk along the shoreline in Oak Bluffs, watching the calm before the storm. After breakfast in my room at the hotel, we visited the field site, Martha’s Vineyard Coastal Observatory which is operated by the Woods Hole Oceanographic Institution (WHOI). They provided a fenced area for us to set up the Mini Micropulse Lidar, an instrument that is helpful for looking at small particles in the atmosphere, especially those in the layer closest to the Earth’s surface. The instrument is up and running, and is already giving us vertical profiles of the atmosphere (pictured below)!","type":"content","url":"/posts/2023/wfip3-day3-4#onto-the-marthas-vineyard-site","position":7},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Days 3-4: A Full Weekend","lvl2":"Off to Rhode Island"},"type":"lvl2","url":"/posts/2023/wfip3-day3-4#off-to-rhode-island","position":8},{"hierarchy":{"lvl1":"Argonne Instruments at WFIP3: Days 3-4: A Full Weekend","lvl2":"Off to Rhode Island"},"content":"After wrapping up in Martha’s Vineyard, we took the ferry back to Wood’s Hole and set our GPS to Narragansett, Rhode Island, which was our anticipated next site. We grabbed dinner at The Coast Guard House, a convenient walk across the street.\n\nWhile we will not deploy tomorrow due to high winds and heavy rain, we will have a chance to run to the store to grab additional supplies required for other sites this week, as well as take a look at the data from instruments already running (the Sodar and mini micropulse lidar).","type":"content","url":"/posts/2023/wfip3-day3-4#off-to-rhode-island","position":9},{"hierarchy":{"lvl1":"SciPy 2025 🐍"},"type":"lvl1","url":"/posts/2025/scipy-2025-takeaways","position":0},{"hierarchy":{"lvl1":"SciPy 2025 🐍"},"content":"Caution\n\nThis blog post expresses my own personal opinion, not that of my employer.\n\n","type":"content","url":"/posts/2025/scipy-2025-takeaways","position":1},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl2":"What is SciPy?"},"type":"lvl2","url":"/posts/2025/scipy-2025-takeaways#what-is-scipy","position":2},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl2":"What is SciPy?"},"content":"The term SciPy refers to multiple things - mainly:\n\nSciPy the Project\n\nSciPy the Community\n\nSciPy the Conference\n\nThis week brought together all three; with the general event being SciPy the conference, consisting of tutorials, talks, and sprints! It brought together multiple disciplines together for the week, ranging from astronomers and physicists to geoscientists like myself. The one thing we all have in common is our passion for the scientific python programming language and the associated community that we all love.","type":"content","url":"/posts/2025/scipy-2025-takeaways#what-is-scipy","position":3},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl2":"The Tutorials"},"type":"lvl2","url":"/posts/2025/scipy-2025-takeaways#the-tutorials","position":4},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl2":"The Tutorials"},"content":"I spent the first couple days at tutorials. Two of the sessions I attended particularly stood as opportunities to improve the way I work!","type":"content","url":"/posts/2025/scipy-2025-takeaways#the-tutorials","position":5},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl3":"Projects with Pixi","lvl2":"The Tutorials"},"type":"lvl3","url":"/posts/2025/scipy-2025-takeaways#projects-with-pixi","position":6},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl3":"Projects with Pixi","lvl2":"The Tutorials"},"content":"\n\nThe first being pixi; for those who are not familiar with pixi, it is a software environment tool that empowers more reproducible workflows regardless of the operating system. If you are interested in getting started with pixi, please use the following steps\n\ncurl -fsSL https://pixi.sh/install.sh | sh\n\npowershell -ExecutionPolicy ByPass -c \"irm -useb https://pixi.sh/install.ps1 | iex\"\n\nAfter restarting your shell, you can start with your first project using:pixi init my_project\n\nI encourage you to look more into their \n\nPython project tutorial section as well as their \n\nswitching from mamba/conda guide","type":"content","url":"/posts/2025/scipy-2025-takeaways#projects-with-pixi","position":7},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl3":"Large Language Models in Python","lvl2":"The Tutorials"},"type":"lvl3","url":"/posts/2025/scipy-2025-takeaways#large-language-models-in-python","position":8},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl3":"Large Language Models in Python","lvl2":"The Tutorials"},"content":"“Building with Large Language Models (LLMs) Made Simple” was another fascinating tutorial! I have only ever used ChatGPT (or similar LLM tools) from their web interface until Monday.\n\nYou can download the materials locally using the following:git clone https://github.com/ericmjl/building-with-llms-made-simple\ncd building-with-llms-made-simple\npixi run start # You alread have this installed if you followed the previous suggestion!\n\nThis tutorial made use of marimo notebooks, which is not necessarily a new project, but a tool I have yet to use! The key difference between these are typical Jupyter notebooks is that marimo notebooks are:\n\nPython scripts that can include specific dependencies directly in that script\n\nRestrictive on redefining variables in different code blocks\n\nMuch easier to track on GitHub since they are not json\n\nHere is a link to marimo documentation if you are interested!","type":"content","url":"/posts/2025/scipy-2025-takeaways#large-language-models-in-python","position":9},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl2":"The Conference"},"type":"lvl2","url":"/posts/2025/scipy-2025-takeaways#the-conference","position":10},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl2":"The Conference"},"content":"The conference officially kicked off on Wednesday morning, with a keynote address and the tracks quickly following that. While specific tracks vary by year, one of the constants is the Earth, Geo, Ocean, Climate, and Atmospheric Science track. I have served as co-chair of this part of the conference for the last few years; recruiting abstract submissions and curating a set of talks that will interest the broader community.","type":"content","url":"/posts/2025/scipy-2025-takeaways#the-conference","position":11},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl3":"The Earth, Ocean, Geo, Climate, and Atmospheric Science Track","lvl2":"The Conference"},"type":"lvl3","url":"/posts/2025/scipy-2025-takeaways#the-earth-ocean-geo-climate-and-atmospheric-science-track","position":12},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl3":"The Earth, Ocean, Geo, Climate, and Atmospheric Science Track","lvl2":"The Conference"},"content":"I would like to highlight the Earth Geo track talks for anyone interested! The main talking points from this part of the symposium is that the \n\nPangeo stack (ie. xarray and friends) is continuing to improve, becoming both more flexible, scalable, and consistent!\n\nPython for Climate Science: Using Intake to provide easy access to Climate Model data\n\nBreaking Out of the Loop: Refactoring Legacy Software with Polars\n\nCubed: Scalable array processing with bounded-memory in Python\n\nUsing Discrete Global Grid Systems in the Pangeo ecosystem\n\ntobac: Tracking Atmospheric Phenomena on Multiscale, Multivariate Diverse Datasets\n\nVirtualiZarr and Icechunk: How to build a cloud-optimised datacube of archival files in 3 lines of xarray\n\nThe brave new world of slicing and dicing Xarray objects.","type":"content","url":"/posts/2025/scipy-2025-takeaways#the-earth-ocean-geo-climate-and-atmospheric-science-track","position":13},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl3":"Lightning Talks","lvl2":"The Conference"},"type":"lvl3","url":"/posts/2025/scipy-2025-takeaways#lightning-talks","position":14},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl3":"Lightning Talks","lvl2":"The Conference"},"content":"Each afternoon, SciPy has a tradition of holding 5-minute lightning talks ⚡, wherein potential presenters submit their name and title of their talk in a bin at the NumFocus Booth for a chance to present. Organizers then pull these slips of paper at random during the session! Presenters do not know they are up to present until minutes before. There is a bit of humor mixed in - where non-first-timers spin a wheel-of-doom which determines an obstacle that they must incorporate into their talk! Obstacles include\n\nThe dreaded lobster claw 🦞 (a claw for hands, often reeking havoc on typing)\n\n1-2 minutes chopped off of their allotted time\n\nMaking an animal noise of the organizers’ choosing\n\nThis was the first year I presented a lightning talk! Mine was focused on organizing a theoretical Jimmy Buffett Summer School, using the template I worked on as a part of the Hack-the-Hackathon event last fall. The template provides all you need to stand up a Github-hosted website with connections to executable environments, checklists for preparation, and suggested schedules! If you are interested in these resources, please see the following links\n\nCookiecutter-based template, command line based\n\nGithub template, non-command line","type":"content","url":"/posts/2025/scipy-2025-takeaways#lightning-talks","position":15},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl2":"Exploring Tacoma and Seattle"},"type":"lvl2","url":"/posts/2025/scipy-2025-takeaways#exploring-tacoma-and-seattle","position":16},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl2":"Exploring Tacoma and Seattle"},"content":"I took some time to explore the Tacoma/Seattle area. If I had any advice for first-time SciPy attendees, it’s that you do not need to, nor should you, attend every single session. Take time for yourself, especially your mental health, and \n\nexplore the region! Some highlights of exploring included:\n\nWatching \n\nfloat planes take off and land along Puget Sound\n\nCatching up with a graduate school friend while \n\nhiking around Point Defiance\n\nA day hike at \n\nMount Rainier National Park\n\n\n\n(a)Float Plane\n\n\n\n(b)Hiking Point Defiance with my friend Troy\n\n\n\n(c)Mount Rainier with a marmot","type":"content","url":"/posts/2025/scipy-2025-takeaways#exploring-tacoma-and-seattle","position":17},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl2":"Conclusions"},"type":"lvl2","url":"/posts/2025/scipy-2025-takeaways#conclusions","position":18},{"hierarchy":{"lvl1":"SciPy 2025 🐍","lvl2":"Conclusions"},"content":"I love SciPy so much. It has given a great amount: friends, community, inspiration, and most of all a sense of belonging. I count down to SciPy every year - an opportunity to come together with our community and reconnect. While it was a smaller event this year, filled with broad uncertainty regarding the future of open source/science support, it was a breath of fresh air that was sorely needed. I feel a new sense of inspiration returning to Chicago, hopeful our community will continue to grow, improve, and carry on.","type":"content","url":"/posts/2025/scipy-2025-takeaways#conclusions","position":19},{"hierarchy":{"lvl1":"Talks"},"type":"lvl1","url":"/talks","position":0},{"hierarchy":{"lvl1":"Talks"},"content":"ARMing the Open Science Community with Radar Cookbooks\n\nAMS Annual Meeting 2023\n\nARM Jupyterhub Tutorial\n\nARM Workshop Series 2023\n\nAtmospheric Python Workshop\n\nMSCAR Conference 2022\n\nIntake-ESM Tutorial\n\nProject Pythia Tutorial 2021\n\nMETAR Support in MetPy\n\nUnidata Summer Internship 2019","type":"content","url":"/talks","position":1},{"hierarchy":{"lvl1":"Workshops"},"type":"lvl1","url":"/workshops","position":0},{"hierarchy":{"lvl1":"Workshops"},"content":"I have led several workshops and tutorials related to learning how to use software tools with weather and climate data!\n\n\n\nOpen Radar Science Workshops\n\nAs a co-lead of workshops in the Open Radar Science community, we host workshops at both the European Weather Radar Meeting (ERAD) and American Meteorological Society Radar Meeting (AMS).\n\nAMS 2025\n\nERAD 2024\n\nAMS 2023\n\nERAD 2023\n\n\n\nARM Summer Schools\n\nAs a co-lead of workforce development for the U.S. Department of Energy Atmospheric Radiation Measurement (ARM) user facility, we host summer school events to train the community how to use open-source tools when working with ARM data.\n\nBNF Open Science in the Forest 2025\n\nCAPE-k Summer School\n\nARM Open Science Summer School 2024","type":"content","url":"/workshops","position":1}]}